Haico-CC/ESP32-Qinux/ESP32-Qinux.ino
#include <WiFi.h>
#include <WebServer.h>
#include <DNSServer.h>
#include <WebSocketsServer.h>
#include <LittleFS.h>
#include <FS.h>
#include <time.h>
#include <sys/time.h>
#include <vector>
#include <map>
#include <utility>
#include "llm.h"

// LLM Bridge 接口声明
bool llm_bridge_init(const char*, const char*);
bool llm_bridge_generate(const char*, int, llm_token_cb, generated_complete_cb, void*);
bool llm_bridge_is_ready();
bool llm_bridge_is_busy();
void llm_bridge_free();

// ========== 配置参数 ==========
const char* AP_SSID = "Welcome Back to the 80's !";
const char* AP_PASS = "";
const byte DNS_PORT = 53;
IPAddress AP_IP(192, 168, 4, 1);
const unsigned long SERIAL_BAUD = 115200;

// ========== 分块传输配置 ==========
const size_t CHUNK_SIZE = 4096;
const size_t MAX_FILE_SIZE = 5 * 1024 * 1024;
const uint32_t CHUNK_TIMEOUT = 8000;

// ========== 全局对象 ==========
DNSServer dnsServer;
WebServer webServer(80);
WebSocketsServer webSocket(81);

// ========== 全局状态 ==========
String currentPath = "/";
String serialInputBuffer = "";
bool isEditing = false;
String editingFilePath = "";
int g_lastExitCode = 0;

// ========== LLM 全局状态 ==========
uint8_t llmActiveClient = 255;
bool llmGenerationActive = false;
const char* LLM_MODEL_PATH = "/bin/stories260K.bin";
const char* LLM_TOKEN_PATH = "/bin/tok512.bin";

// ========== 分块传输状态 ==========
struct ChunkTransferState {
  bool active = false;
  bool isUpload = false;
  bool sending = false;
  String filename;
  size_t totalSize = 0;
  size_t totalChunks = 0;
  size_t currentChunk = 0;
  size_t clientChunkSize = CHUNK_SIZE;
  File file;
  uint32_t lastChunkTime = 0;
  uint8_t clientNum = 255;
  int lastPrintedProgress = -1;
};
ChunkTransferState chunkState;

// ========== 受保护目录列表 ==========
const char* PROTECTED_DIRS[] = { "/bin", "/etc", "/sys" };
const int PROTECTED_COUNT = sizeof(PROTECTED_DIRS) / sizeof(PROTECTED_DIRS[0]);

// ========== Web 编辑器映射 ==========
std::map<uint8_t, String> clientEditFiles;

bool isProtectedPath(const String& path) {
  String resolved = resolvePath(path);
  for (int i = 0; i < PROTECTED_COUNT; i++) {
    if (resolved == PROTECTED_DIRS[i] || resolved.startsWith(String(PROTECTED_DIRS[i]) + "/")) {
      return true;
    }
  }
  return false;
}

bool canWritePath(const String& path) {
  return !isProtectedPath(path);
}

// ========== 脚本执行上下文 ==========
std::map<String, String> scriptVars;
std::vector<String> scriptInputLines;
int scriptInputIndex = 0;
bool scriptWaitingInput = false;
String scriptInputVarName = "";

// ========== Fortune彩蛋库 ==========
const char* FORTUNES[] PROGMEM = {
  "🔮 The cake is a lie.", "🔮 sudo make me a sandwich", "🔮 Everything is... 42.",
  "🔮 Have you tried turning it off and on again?", "🔮 It works on my machine.",
  "🔮 There's no place like 127.0.0.1", "🔮 To err is human, to really foul things up requires root.",
  "🔮 I'm not lazy, I'm in energy-saving mode.", "🔮 Hardware: The part of a computer that can be kicked.",
  "🔮 All your base are belong to us.", "🔮 Talk is cheap. Show me the code. - Linus Torvalds",
  "🔮 First, solve the problem. Then, write the code. - John Johnson",
  "🔮 ESP32: Because sometimes you need two cores to handle the chaos.",
  "🔮 Debugging: Being the detective in a crime movie where you are also the murderer.",
  "🔮 Coffee: The official programming language of ESP32 developers.",
  "🔮 Warning: May contain traces of undefined behavior.",
  "🔮 If at first you don't succeed; call it version 1.0.",
  "🔮 I would agree with you, but then we'd both be wrong.",
  "🔮 My code doesn't have bugs, it just develops random features.",
  "🔮 Keep calm and rm -rf /"
};
const int FORTUNE_COUNT = sizeof(FORTUNES) / sizeof(FORTUNES[0]);

// ========== Base64编解码 ==========
static const char* b64_chars = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";

String base64Encode(const uint8_t* data, size_t length) {
  String ret;
  int i = 0, j = 0;
  uint8_t char_array_3[3], char_array_4[4];
  while (length--) {
    char_array_3[i++] = *(data++);
    if (i == 3) {
      char_array_4[0] = (char_array_3[0] & 0xfc) >> 2;
      char_array_4[1] = ((char_array_3[0] & 0x03) << 4) + ((char_array_3[1] & 0xf0) >> 4);
      char_array_4[2] = ((char_array_3[1] & 0x0f) << 2) + ((char_array_3[2] & 0xc0) >> 6);
      char_array_4[3] = char_array_3[2] & 0x3f;
      for (i = 0; i < 4; i++) ret += b64_chars[char_array_4[i]];
      i = 0;
    }
  }
  if (i) {
    for (j = i; j < 3; j++) char_array_3[j] = '\0';
    char_array_4[0] = (char_array_3[0] & 0xfc) >> 2;
    char_array_4[1] = ((char_array_3[0] & 0x03) << 4) + ((char_array_3[1] & 0xf0) >> 4);
    char_array_4[2] = ((char_array_3[1] & 0x0f) << 2) + ((char_array_3[2] & 0xc0) >> 6);
    char_array_4[3] = char_array_3[2] & 0x3f;
    for (j = 0; j < i + 1; j++) ret += b64_chars[char_array_4[j]];
    while ((i++ < 3)) ret += '=';
  }
  return ret;
}

static inline bool is_base64(uint8_t c) {
  return (isalnum(c) || (c == '+') || (c == '/'));
}

std::vector<uint8_t> base64Decode(const String& encoded_string) {
  int in_len = encoded_string.length();
  int i = 0, j = 0, in_ = 0;
  uint8_t char_array_4[4], char_array_3[3];
  std::vector<uint8_t> ret;
  while (in_len-- && (encoded_string[in_] != '=') && is_base64(encoded_string[in_])) {
    char_array_4[i++] = encoded_string[in_];
    in_++;
    if (i == 4) {
      for (i = 0; i < 4; i++) char_array_4[i] = strchr(b64_chars, char_array_4[i]) - b64_chars;
      char_array_3[0] = (char_array_4[0] << 2) + ((char_array_4[1] & 0x30) >> 4);
      char_array_3[1] = ((char_array_4[1] & 0xf) << 4) + ((char_array_4[2] & 0x3c) >> 2);
      char_array_3[2] = ((char_array_4[2] & 0x3) << 6) + char_array_4[3];
      for (i = 0; (i < 3); i++) ret.push_back(char_array_3[i]);
      i = 0;
    }
  }
  if (i) {
    for (j = i; j < 4; j++) char_array_4[j] = 0;
    for (j = 0; j < 4; j++) char_array_4[j] = strchr(b64_chars, char_array_4[j]) - b64_chars;
    char_array_3[0] = (char_array_4[0] << 2) + ((char_array_4[1] & 0x30) >> 4);
    char_array_3[1] = ((char_array_4[1] & 0xf) << 4) + ((char_array_4[2] & 0x3c) >> 2);
    char_array_3[2] = ((char_array_4[2] & 0x3) << 6) + char_array_4[3];
    for (j = 0; (j < i - 1); j++) ret.push_back(char_array_3[j]);
  }
  return ret;
}

// ========== 路径处理辅助函数 ==========
String joinPath(String base, String sub) {
  if (base == "/") return "/" + sub;
  return base + "/" + sub;
}

String resolvePath(String inputPath) {
  String fullPath = inputPath.startsWith("/") ? inputPath : (currentPath == "/" ? "/" + inputPath : currentPath + "/" + inputPath);
  while (fullPath.indexOf("//") != -1) fullPath.replace("//", "/");
  std::vector<String> parts;
  int start = 0;
  for (int i = 0; i <= fullPath.length(); i++) {
    if (i == fullPath.length() || fullPath[i] == '/') {
      String part = fullPath.substring(start, i);
      if (part == "" || part == ".") {
        start = i + 1;
        continue;
      }
      if (part == "..") {
        if (!parts.empty()) parts.pop_back();
      } else {
        parts.push_back(part);
      }
      start = i + 1;
    }
  }
  String result = "/";
  for (size_t i = 0; i < parts.size(); i++) {
    if (i > 0) result += "/";
    result += parts[i];
  }
  return result;
}

// ========== JSON转义 ==========
String escapeJson(String str) {
  String result = "";
  for (size_t i = 0; i < str.length(); i++) {
    char c = str[i];
    if (c == '\\') result += "\\\\";
    else if (c == '"') result += "\\\"";
    else if (c == '\n') result += "\\n";
    else if (c == '\r') result += "\\r";
    else if (c == '\t') result += "\\t";
    else if ((unsigned char)c < 0x20) {
      // 转义其他控制字符（0x00-0x1F），防止 JSON 非法
      char buf[8];
      snprintf(buf, sizeof(buf), "\\u%04x", (unsigned char)c);
      result += buf;
    }
    else result += c;
  }
  return result;
}

// ========== 时间处理 ==========
void setSystemTime(time_t epochSecs) {
  struct timeval tv = { epochSecs, 0 };
  settimeofday(&tv, NULL);
}

bool parseDateTimeString(String dateStr, time_t& outTime) {
  int year, month, day, hour, minute, second;
  if (sscanf(dateStr.c_str(), "%d-%d-%d %d:%d:%d", &year, &month, &day, &hour, &minute, &second) == 6) {
    struct tm timeinfo = {};
    timeinfo.tm_year = year - 1900;
    timeinfo.tm_mon = month - 1;
    timeinfo.tm_mday = day;
    timeinfo.tm_hour = hour;
    timeinfo.tm_min = minute;
    timeinfo.tm_sec = second;
    outTime = mktime(&timeinfo);
    return true;
  }
  return false;
}

