Haico-CC/ESP32-Qinux/ESP32-Qinux.ino
// ========== 系统信息 ==========
String getResetReason() {
  esp_reset_reason_t reason = esp_reset_reason();
  switch (reason) {
    case ESP_RST_POWERON: return "Power On";
    case ESP_RST_EXT: return "External Pin";
    case ESP_RST_SW: return "Software Reset";
    case ESP_RST_PANIC: return "Exception/Panic";
    case ESP_RST_INT_WDT: return "Interrupt WDT";
    case ESP_RST_TASK_WDT: return "Task WDT";
    case ESP_RST_WDT: return "Other WDT";
    case ESP_RST_DEEPSLEEP: return "Deep Sleep Wakeup";
    case ESP_RST_BROWNOUT: return "Brownout";
    case ESP_RST_SDIO: return "SDIO";
    default: return "Unknown";
  }
}

// ========== GPIO安全校验 ==========
bool isSafeGpio(int pin) {
#if defined(CONFIG_IDF_TARGET_ESP32)
  return (pin == 2 || pin == 4 || pin == 5 || pin == 12 || pin == 13 || pin == 14 || pin == 15 || pin == 18 || pin == 19 || pin == 21 || pin == 22 || pin == 23 || pin == 25 || pin == 26 || pin == 27 || pin == 32 || pin == 33);
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
  return (pin >= 1 && pin <= 10) || (pin >= 18 && pin <= 19);
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
  return (pin >= 1 && pin <= 18) || (pin == 21);
#else
  return (pin == 2 || pin == 4 || pin == 5 || pin == 12 || pin == 13);
#endif
}

void initAllGpioLow() {
  for (int pin = 0; pin <= 48; pin++) {
    if (isSafeGpio(pin)) {
      pinMode(pin, OUTPUT);
      digitalWrite(pin, LOW);
    }
  }
}

String getSafeGpioList() {
#if defined(CONFIG_IDF_TARGET_ESP32)
  return "2, 4, 5, 12-15, 18-19, 21-23, 25-27, 32-33";
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
  return "1-10, 18-19";
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
  return "1-18, 21";
#else
  return "2, 4, 5, 12, 13";
#endif
}

// ========== ADC引脚校验 ==========
bool isAdc1Pin(int pin) {
#if defined(CONFIG_IDF_TARGET_ESP32)
  return (pin == 32 || pin == 33 || pin == 34 || pin == 35 || pin == 36 || pin == 39);
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
  return (pin >= 0 && pin <= 4);
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
  return (pin >= 1 && pin <= 10);
#else
  return (pin == 4);
#endif
}

String getAdc1ValidPins() {
#if defined(CONFIG_IDF_TARGET_ESP32)
  return "32, 33, 34, 35, 36, 39";
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
  return "0, 1, 2, 3, 4";
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
  return "1, 2, 3, 4, 5, 6, 7, 8, 9, 10";
#else
  return "4";
#endif
}

// ========== WiFi状态显示辅助 ==========
String getWiFiModeStr(wifi_mode_t mode) {
  switch (mode) {
    case WIFI_OFF: return "OFF";
    case WIFI_STA: return "STA";
    case WIFI_AP: return "AP";
    case WIFI_AP_STA: return "AP+STA";
    default: return "Unknown";
  }
}

String getAuthModeStr(wifi_auth_mode_t auth) {
  switch (auth) {
    case WIFI_AUTH_OPEN: return "OPEN";
    case WIFI_AUTH_WEP: return "WEP";
    case WIFI_AUTH_WPA_PSK: return "WPA-PSK";
    case WIFI_AUTH_WPA2_PSK: return "WPA2-PSK";
    case WIFI_AUTH_WPA_WPA2_PSK: return "WPA/WPA2-PSK";
    case WIFI_AUTH_WPA3_PSK: return "WPA3-PSK";
    default: return "Unknown";
  }
}

// ========= WiFi功率转换辅助函数（Core 3.x修复）=========
#if ESP_ARDUINO_VERSION_MAJOR >= 3
wifi_power_t dbmToWifiPower(int dbm) {
  int enum_val = (int)((float)dbm * 4.0f + 0.5f);
  return static_cast<wifi_power_t>(constrain(enum_val, -4, 84));
}
float wifiPowerToDbm(wifi_power_t power) {
  return (float)power / 4.0f;
}
int getWiFiTxPowerDbm() {
  wifi_power_t power = WiFi.getTxPower();
  return (int)(wifiPowerToDbm(power) + 0.5f);
}
#endif

bool setWiFiTxPower(int dbm) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  dbm = constrain(dbm, -1, 21);
  wifi_power_t power_enum = dbmToWifiPower(dbm);
  return WiFi.setTxPower(power_enum);
#else
  dbm = constrain(dbm, -20, 20);
  return WiFi.setTxPower(dbm);
#endif
}

void handleWifiCommand(String args, String& output) {
  args.trim();
  if (args.isEmpty() || args == "status") {
    output += "=== WiFi Status ===\n";
    output += "wifi: Mode:      " + getWiFiModeStr(WiFi.getMode()) + "\n";
    if (WiFi.getMode() & WIFI_AP) {
      output += "wifi: AP SSID:   " + WiFi.softAPSSID() + "\n";
      output += "wifi: AP IP:     " + WiFi.softAPIP().toString() + "\n";
      output += "wifi: Clients:   " + String(WiFi.softAPgetStationNum()) + "\n";
    }
    if (WiFi.getMode() & WIFI_STA) {
      if (WiFi.status() == WL_CONNECTED) {
        output += "wifi: STA SSID:   " + WiFi.SSID() + "\n";
        output += "wifi: STA IP:     " + WiFi.localIP().toString() + "\n";
        output += "wifi: RSSI:       " + String(WiFi.RSSI()) + " dBm\n";
      } else output += "wifi: STA:        Disconnected\n";
    }
    output += "wifi: Channel:   " + String(WiFi.channel()) + "\n";
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    output += "wifi: Tx Power:  " + String(getWiFiTxPowerDbm()) + " dBm\n";
#else
    output += "wifi: Tx Power:  " + String(WiFi.getTxPower()) + " dBm\n";
#endif
    output += "wifi: MAC:       " + WiFi.macAddress() + "\n";
    return;
  }
  if (args == "info") {
    output += "=== WiFi Configuration ===\n";
    output += "Mode:            " + getWiFiModeStr(WiFi.getMode()) + "\n";
    output += "SDK Version:     " + String(ESP.getSdkVersion()) + "\n";
#if ESP_ARDUINO_VERSION_MAJOR < 3
    output += "PHY Mode:        " + String(WiFi.getPhyMode()) + "\n";
    output += "Sleep Mode:      " + String(WiFi.getSleepMode()) + "\n";
    output += "Min Rate:        " + String(WiFi.getMinRate() / 2) + " Mbps\n";
    output += "Max Rate:        " + String(WiFi.getMaxRate() / 2) + " Mbps\n";
#else
    output += "PHY Mode:        N/A (Core 3.x)\n";
    output += "Sleep Mode:      " + String(WiFi.getSleep() ? "Enabled" : "Disabled") + "\n";
    output += "Min Rate:        N/A\n";
    output += "Max Rate:        N/A\n";
#endif
    output += "MAC Address:     " + WiFi.macAddress() + "\n";
    output += "Channel:         " + String(WiFi.channel()) + "\n";
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    output += "Tx Power:        " + String(getWiFiTxPowerDbm()) + " dBm\n";
#else
    output += "Tx Power:        " + String(WiFi.getTxPower()) + " dBm\n";
#endif
    if (WiFi.getMode() & WIFI_AP) {
      output += "\n[AP Configuration]\n";
      output += "SSID:            " + WiFi.softAPSSID() + "\n";
#if ESP_ARDUINO_VERSION_MAJOR < 3
      output += "Auth Mode:       " + getAuthModeStr(WiFi.softAPgetAuthMode()) + "\n";
#else
      output += "Auth Mode:       WPA2-PSK (default)\n";
#endif
      output += "IP Address:      " + WiFi.softAPIP().toString() + "\n";
      output += "Subnet Mask:     " + WiFi.softAPSubnetMask().toString() + "\n";
      output += "Gateway:         " + WiFi.softAPIP().toString() + "\n";
      output += "MAC:             " + WiFi.softAPmacAddress() + "\n";
      output += "Connected:       " + String(WiFi.softAPgetStationNum()) + "/4\n";
    }
    if (WiFi.getMode() & WIFI_STA) {
      output += "\n[STA Configuration]\n";
      output += "Status:          " + String(WiFi.status() == WL_CONNECTED ? "Connected" : "Disconnected") + "\n";
      if (WiFi.status() == WL_CONNECTED) {
        output += "SSID:            " + WiFi.SSID() + "\n";
        output += "BSSID:           " + WiFi.BSSIDstr() + "\n";
        output += "IP Address:      " + WiFi.localIP().toString() + "\n";
        output += "RSSI:            " + String(WiFi.RSSI()) + " dBm\n";
        output += "Channel:         " + String(WiFi.channel()) + "\n";
      }
    }
    return;
  }
  if (args == "scan") {
    output += "wifi: Scanning nearby networks...\n";
    int n = WiFi.scanNetworks();
    if (n == WIFI_SCAN_FAILED) output += "wifi: Scan failed\n";
    else if (n == 0) output += "wifi: No networks found\n";
    else {
      output += "wifi: Found " + String(n) + " network(s)\n";
      output += "wifi: RSSI | CH | AUTH     | SSID\n";
      output += "wifi: -----+----+----------+----------------\n";
      for (int i = 0; i < n && i < 25; i++) {
        String auth = getAuthModeStr(WiFi.encryptionType(i));
        char buf[80];
        snprintf(buf, sizeof(buf), "wifi: %4d | %2d | %-10s | %s\n", WiFi.RSSI(i), WiFi.channel(i), auth.c_str(), WiFi.SSID(i).c_str());
        output += buf;
        yield();
      }
      if (n > 25) output += "wifi: ... +" + String(n - 25) + " more\n";
    }
    WiFi.scanDelete();
    return;
  }
  if (args == "stats") {
    output += "=== WiFi Statistics ===\n";
    output += "RSSI:            " + String(WiFi.RSSI()) + " dBm\n";
    int rssi = WiFi.RSSI();
    String quality = (rssi >= -50) ? "Excellent" : (rssi >= -67) ? "Good"
                                                 : (rssi >= -78) ? "Fair"
                                                 : (rssi >= -90) ? "Poor"
                                                                 : "No Signal";
    output += "Signal Quality:  " + quality + "\n";
#if ESP_ARDUINO_VERSION_MAJOR < 3
    output += "Current Rate:    " + String(WiFi.getPhyMode()) + "\n";
    output += "Min Rate:        " + String(WiFi.getMinRate() / 2) + " Mbps\n";
    output += "Max Rate:        " + String(WiFi.getMaxRate() / 2) + " Mbps\n";
#else
    output += "Current Rate:    N/A (Core 3.x)\n";
    output += "Min Rate:        N/A\n";
    output += "Max Rate:        N/A\n";
#endif
    return;
  }
  if (args == "set power" || args.startsWith("set power ")) {
    String valStr = (args == "set power") ? "" : args.substring(10);
    valStr.trim();

    if (valStr.isEmpty()) {
      output = "wifi: Usage: wifi set power <dBm>\n";
      output += "wifi: Range: 2 (min) ~ 20 (max) dBm [Core 3.x]\n";
      output += "wifi: Step: 0.5 dBm granularity\n";
#if ESP_ARDUINO_VERSION_MAJOR >= 3
      output += "wifi: Current: " + String(getWiFiTxPowerDbm()) + " dBm\n";
#else
      output += "wifi: Current: " + String(WiFi.getTxPower()) + " dBm\n";
#endif
      output += "wifi: Note: Actual power may be limited by WiFi mode (b/g/n)\n";
      return;
    }

    int power = valStr.toInt();

