Haico-CC/ESP32-Qinux/ESP32-Qinux.ino
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    if (power < 2 || power > 20) {
      output = "wifi: Error: Power must be 2 ~ 20 dBm (Core 3.x)\n";
      return;
    }
#else
    if (power < -20 || power > 20) {
      output = "wifi: Error: Power must be -20 ~ 20 dBm (Core 2.x)\n";
      return;
    }
#endif

    if (setWiFiTxPower(power)) {
      output = "wifi: Tx power set to " + String(power) + " dBm\n";
      wifi_mode_t mode = WiFi.getMode();
      if (mode & WIFI_STA) {
        output += "wifi: Note: In 802.11n mode, max ~15dBm may apply\n";
      }
    } else {
      output = "wifi: Failed to set power (check WiFi mode/state)\n";
    }
    return;
  }
  output += "WiFi Commands (Safe Mode):\n";
  output += "  wifi [status]        - Show WiFi status summary\n";
  output += "  wifi info            - Display detailed configuration\n";
  output += "  wifi scan            - Scan nearby wireless networks\n";
  output += "  wifi stats           - Show signal quality & rate info\n";
  output += "  wifi set power <dBm> - Adjust TX power (2~20, safe)\n\n";
  output += "Note: Commands that change SSID/channel/mode are disabled\n";
  output += "      to prevent WebSocket disconnection.\n";
}

// ========== 目录递归删除 ==========
bool deleteDirectoryRecursive(String path) {
  if (path == "/" || path == "") return false;
  if (isProtectedPath(path)) return false;
  File dir = LittleFS.open(path, "r");
  if (!dir || !dir.isDirectory()) {
    if (dir) dir.close();
    return false;
  }
  std::vector<String> items;
  File item = dir.openNextFile();
  while (item) {
    String itemPath = item.path();
    if (itemPath.isEmpty()) {
      String itemName = item.name();
      int lastSlash = itemName.lastIndexOf('/');
      if (lastSlash != -1) itemName = itemName.substring(lastSlash + 1);
      itemPath = joinPath(path, itemName);
    }
    if (!isProtectedPath(itemPath)) { items.push_back(itemPath); }
    item.close();
    item = dir.openNextFile();
  }
  dir.close();
  bool success = true;
  for (const String& itemPath : items) {
    File check = LittleFS.open(itemPath, "r");
    bool isDir = (check && check.isDirectory());
    if (check) check.close();
    if (isDir) {
      if (!deleteDirectoryRecursive(itemPath)) success = false;
    } else {
      if (!LittleFS.remove(itemPath)) success = false;
    }
    yield();
  }
  if (success && !LittleFS.rmdir(path)) success = false;
  return success;
}

// ========== 脚本解释器辅助函数 ==========
String extractSubstring(String str, int start, int end) {
  String res = "";
  for (int i = start; i < end && i < str.length(); i++) res += str[i];
  return res;
}

int calculateExpression(String expr) {
  expr.trim();
  if (expr.isEmpty()) return 0;
  int parenDepth = 0, lastOpenParen = -1;
  for (int i = 0; i < expr.length(); i++) {
    if (expr[i] == '(') {
      lastOpenParen = i;
      parenDepth++;
    } else if (expr[i] == ')') {
      parenDepth--;
      if (parenDepth == 0 && lastOpenParen != -1) {
        String left = extractSubstring(expr, 0, lastOpenParen);
        String mid = extractSubstring(expr, lastOpenParen + 1, i);
        String right = extractSubstring(expr, i + 1, expr.length());
        int midVal = calculateExpression(mid);
        return calculateExpression(left + String(midVal) + right);
      }
    }
  }
  String clean = "";
  for (int i = 0; i < expr.length(); i++)
    if (expr[i] != ' ') clean += expr[i];
  if (clean.isEmpty()) return 0;
  std::vector<int> nums;
  std::vector<char> ops;
  String numStr;
  for (int i = 0; i <= clean.length(); i++) {
    char c = (i == clean.length()) ? '+' : clean[i];
    if (isdigit(c) || (c == '-' && (i == 0 || !isdigit(clean[i - 1])))) numStr += c;
    else {
      if (!numStr.isEmpty()) {
        nums.push_back(numStr.toInt());
        numStr = "";
      }
      if (i < clean.length()) ops.push_back(c);
    }
  }
  if (nums.empty()) return 0;
  for (int i = 0; i < ops.size();) {
    if (ops[i] == '*' || ops[i] == '/' || ops[i] == '%') {
      int result = (ops[i] == '*') ? nums[i] * nums[i + 1] : (ops[i] == '/') ? (nums[i + 1] ? nums[i] / nums[i + 1] : 0)
                                                                             : (nums[i + 1] ? nums[i] % nums[i + 1] : 0);
      nums[i] = result;
      nums.erase(nums.begin() + i + 1);
      ops.erase(ops.begin() + i);
    } else i++;
  }
  int result = nums[0];
  for (int i = 0; i < ops.size() && i + 1 < nums.size(); i++)
    result = (ops[i] == '+') ? result + nums[i + 1] : result - nums[i + 1];
  return result;
}

String substituteVariables(String line) {
  int pos = 0;
  while ((pos = line.indexOf('$', pos)) != -1) {
    int end = pos + 1;
    if (end >= line.length()) break;
    if (line[end] == '?') end++;
    else
      while (end < line.length() && (isalnum(line[end]) || line[end] == '_')) end++;
    if (end == pos + 1) {
      pos++;
      continue;
    }
    String varName = line.substring(pos + 1, end);
    varName.trim();
    String replacement = (varName == "?") ? String(g_lastExitCode) : (scriptVars.count(varName) ? scriptVars[varName] : "");
    line = line.substring(0, pos) + replacement + line.substring(end);
    pos = pos + replacement.length();
    if (pos > line.length()) pos = line.length();
  }
  return line;
}

bool containsAnyChar(String str, const char* chars) {
  for (int i = 0; chars[i] != 0; i++)
    if (str.indexOf(chars[i]) != -1) return true;
  return false;
}

bool evaluateCondition(String condition) {
  condition.trim();
  if (condition.startsWith("(") && condition.endsWith(")")) {
    condition = condition.substring(1, condition.length() - 1);
    condition.trim();
  }
  const char* ops[] = { "==", "!=", "<=", ">=", "<", ">" };
  int foundOp = -1, opPos = -1;
  for (int i = 0; i < 6; i++) {
    int p = condition.indexOf(ops[i]);
    if (p != -1 && (opPos == -1 || p < opPos)) {
      opPos = p;
      foundOp = i;
    }
  }
  if (foundOp == -1) return !condition.isEmpty();
  String left = condition.substring(0, opPos), right = condition.substring(opPos + strlen(ops[foundOp]));
  left.trim();
  right.trim();
  int leftNum = calculateExpression(left), rightNum = calculateExpression(right);
  bool leftIsNum = (!left.isEmpty() && (String(leftNum) == left || containsAnyChar(left, "+-*/%")));
  bool rightIsNum = (!right.isEmpty() && (String(rightNum) == right || containsAnyChar(right, "+-*/%")));
  if (leftIsNum && rightIsNum) {
    switch (foundOp) {
      case 0: return leftNum == rightNum;
      case 1: return leftNum != rightNum;
      case 2: return leftNum <= rightNum;
      case 3: return leftNum >= rightNum;
      case 4: return leftNum < rightNum;
      case 5: return leftNum > rightNum;
    }
  }
  if (foundOp == 0) return left == right;
  if (foundOp == 1) return left != right;
  return false;
}

