Haico-CC/ESP32-Qinux/ESP32-Qinux.ino
int findBlockEndEx(const std::vector<String>& lines, int startLine, const char* endKeyword) {
  // 使用栈追踪块类型，确保 if→fi、for/while→done 严格配对
  std::vector<String> stack;
  stack.push_back(endKeyword);
  for (int i = startLine; i < (int)lines.size(); i++) {
    String line = lines[i];
    line.trim();
    // 块起始关键字 → 压入期望的结束关键字
    if (line.startsWith("if ")) {
      stack.push_back("fi");
    } else if (line.startsWith("elif ")) {
      // elif 与 if 同级，不增加嵌套；但必须处于 if 块内
      if (stack.empty() || stack.back() != "fi") return -1;
    } else if (line.startsWith("for ") || line.startsWith("while ")) {
      stack.push_back("done");
    } else if (line == "else") {
      // else 不改变期望的结束关键字，但必须处于 if/elif 块内
      if (stack.empty() || stack.back() != "fi") return -1;
    } else if (line == "fi" || line == "done") {
      if (stack.empty()) return -1;
      String expected = stack.back();
      stack.pop_back();
      if (line != expected) return -1;  // 类型不匹配，例如 done 关闭 if
      if (stack.empty()) return i;      // 找到匹配的结束关键字
    }
  }
  return -1;
}

bool loadScriptInput(const String& inputPath) {
  scriptInputLines.clear();
  scriptInputIndex = 0;
  if (!LittleFS.exists(inputPath)) return false;
  File f = LittleFS.open(inputPath, "r");
  if (!f || f.isDirectory()) {
    f.close();
    return false;
  }
  String line;
  while (f.available()) {
    char c = f.read();
    if (c == '\n') {
      scriptInputLines.push_back(line);
      line = "";
    } else if (c != '\r') line += c;
  }
  if (!line.isEmpty()) scriptInputLines.push_back(line);
  f.close();
  return true;
}

bool scriptReadInput(String& varName, String& output) {
  if (scriptInputIndex < (int)scriptInputLines.size()) {
    scriptVars[varName] = scriptInputLines[scriptInputIndex++];
    output += "  > script: read " + varName + " = '" + scriptVars[varName] + "'\n";
    return true;
  }
  output += "  > script: Warning: No more input data\n";
  scriptVars[varName] = "";
  return false;
}

// ========== 前置声明 ==========
void executeCommand(String cmd, String& output, String& newPrompt, bool& clearTerminal, String& dlFileName, String& dlContent, bool& triggerUpload);
void executeScriptBlockEx(const std::vector<String>& lines, int startLine, int endLine, String& output, bool* outBreak = nullptr, bool* outContinue = nullptr);

// ========== 分块传输函数 ==========
bool startChunkedDownload(const String& filePath, uint8_t clientNum) {
  if (!LittleFS.exists(filePath)) return false;
  File f = LittleFS.open(filePath, "r");
  if (!f || f.isDirectory()) {
    if (f) f.close();
    return false;
  }
  size_t fSize = f.size();
  if (fSize > MAX_FILE_SIZE) {
    f.close();
    String err = "{\"output\":\"dl: File too large (max " + String(MAX_FILE_SIZE / 1024) + "KB)\\n\"}";
    webSocket.sendTXT(clientNum, err);
    return false;
  }
  chunkState.active = true;
  chunkState.isUpload = false;
  chunkState.sending = false;
  chunkState.lastPrintedProgress = -1;
  chunkState.filename = filePath.substring(filePath.lastIndexOf('/') + 1);
  chunkState.totalSize = fSize;
  chunkState.totalChunks = (fSize + CHUNK_SIZE - 1) / CHUNK_SIZE;
  chunkState.currentChunk = 0;
  chunkState.file = f;
  chunkState.clientNum = clientNum;
  chunkState.lastChunkTime = millis();
  String header = "{\"dl_start\":{\"filename\":\"" + escapeJson(chunkState.filename) + "\",\"size\":" + String(fSize) + ",\"chunks\":" + String(chunkState.totalChunks) + ",\"chunk_size\":" + String(CHUNK_SIZE) + "}}";
  webSocket.sendTXT(clientNum, header);
  return true;
}

void sendNextChunk() {
  if (!chunkState.active || chunkState.isUpload || chunkState.sending) return;

  if (chunkState.currentChunk >= chunkState.totalChunks) {
    String endMsg = "{\"dl_end\":{\"status\":\"complete\",\"checksum\":\"ok\"}}";
    webSocket.sendTXT(chunkState.clientNum, endMsg);
    chunkState.file.close();
    chunkState.active = false;
    chunkState.sending = false;
    Serial.println("dl: Transfer complete: " + chunkState.filename);
    return;
  }

  chunkState.sending = true;

  size_t offset = chunkState.currentChunk * CHUNK_SIZE;
  size_t readSize = min(CHUNK_SIZE, chunkState.totalSize - offset);

  chunkState.file.seek(offset);
  std::vector<uint8_t> buffer(readSize);
  size_t actuallyRead = chunkState.file.read(buffer.data(), readSize);

  if (actuallyRead != readSize) {
    Serial.printf("dl: Warning: read %d/%d bytes at offset %d\n", actuallyRead, readSize, offset);
  }

  String b64 = base64Encode(buffer.data(), actuallyRead);
  String chunkMsg = "{\"dl_chunk\":{\"index\":" + String(chunkState.currentChunk) + ",\"data\":\"" + b64 + "\",\"size\":" + String(actuallyRead) + ",\"chunk_size\":" + String(CHUNK_SIZE) + ",\"progress\":" + String((chunkState.currentChunk + 1) * 100 / chunkState.totalChunks) + "}}";

  bool sent = webSocket.sendTXT(chunkState.clientNum, chunkMsg);

  if (sent) {
    chunkState.currentChunk++;
    chunkState.lastChunkTime = millis();
    int progress = chunkState.currentChunk * 100 / chunkState.totalChunks;
    if (progress % 10 == 0 && progress != chunkState.lastPrintedProgress) {
      Serial.printf("dl: %s - %d%%\n", chunkState.filename.c_str(), progress);
      chunkState.lastPrintedProgress = progress;
    }
  }

  chunkState.sending = false;
  yield();
}

bool handleUploadStart(const String& filename, size_t totalSize, size_t clientChunkSize, uint8_t clientNum) {
  String safeName = filename;
  safeName.replace("/", "");
  safeName.replace("\\", "");
  safeName.replace("..", "");
  if (safeName.isEmpty()) safeName = "upload_" + String(millis()) + ".bin";
  String fullPath = resolvePath(safeName);
  if (!canWritePath(fullPath)) {
    String err = "{\"ul_ack\":{\"status\":\"error\",\"msg\":\"Permission denied\"}}";
    webSocket.sendTXT(clientNum, err);
    return false;
  }
  if (totalSize > MAX_FILE_SIZE) {
    String err = "{\"ul_ack\":{\"status\":\"error\",\"msg\":\"File too large\"}}";
    webSocket.sendTXT(clientNum, err);
    return false;
  }
  int lastSlash = fullPath.lastIndexOf('/');
  if (lastSlash > 0 && !LittleFS.exists(fullPath.substring(0, lastSlash))) {
    LittleFS.mkdir(fullPath.substring(0, lastSlash));
  }
  chunkState.active = true;
  chunkState.isUpload = true;
  chunkState.sending = false;
  chunkState.lastPrintedProgress = -1;
  chunkState.filename = fullPath;
  chunkState.totalSize = totalSize;
  chunkState.clientChunkSize = (clientChunkSize > 0) ? clientChunkSize : CHUNK_SIZE;
  chunkState.totalChunks = (totalSize + chunkState.clientChunkSize - 1) / chunkState.clientChunkSize;
  chunkState.currentChunk = 0;

