Haico-CC/ESP32-Qinux/ESP32-Qinux.ino
  chunkState.file = LittleFS.open(fullPath, "w");
  chunkState.clientNum = clientNum;
  chunkState.lastChunkTime = millis();
  if (!chunkState.file) {
    chunkState.active = false;
    String err = "{\"ul_ack\":{\"status\":\"error\",\"msg\":\"Cannot create file\"}}";
    webSocket.sendTXT(clientNum, err);
    return false;
  }
  String ack = "{\"ul_ack\":{\"status\":\"ready\",\"chunks\":" + String(chunkState.totalChunks) + "}}";
  webSocket.sendTXT(clientNum, ack);
  return true;
}

bool handleUploadChunk(size_t index, const String& b64Data, uint8_t clientNum) {
  if (!chunkState.active || !chunkState.isUpload || index != chunkState.currentChunk) {
    Serial.printf("ul: Reject chunk %d (expected %d)\n", index, chunkState.currentChunk);
    return false;
  }

  std::vector<uint8_t> binData = base64Decode(b64Data);
  if (binData.empty() && !b64Data.isEmpty()) {
    Serial.println("ul: Base64 decode failed!");
    return false;
  }

  size_t offset = index * chunkState.clientChunkSize;

  if (!chunkState.file.seek(offset)) {
    Serial.printf("ul: seek(%d) failed!\n", offset);
    return false;
  }

  size_t written = chunkState.file.write(binData.data(), binData.size());
  if (written != binData.size()) {
    Serial.printf("ul: Write incomplete: %d/%d bytes at offset %d\n", written, binData.size(), offset);
    if (written < binData.size()) {
      size_t remaining = binData.size() - written;
      size_t written2 = chunkState.file.write(binData.data() + written, remaining);
      if (written2 != remaining) {
        Serial.println("ul: Critical write error after retry!");
        return false;
      }
      written += written2;
    }
  }

  if (chunkState.currentChunk % 8 == 0) {
    chunkState.file.flush();
  }

  chunkState.currentChunk++;
  chunkState.lastChunkTime = millis();

  int progress = chunkState.currentChunk * 100 / chunkState.totalChunks;
  String ack = "{\"ul_ack\":{\"index\":" + String(index) + ",\"received\":" + String(chunkState.currentChunk * chunkState.clientChunkSize) + ",\"progress\":" + String(progress) + "}}";
  webSocket.sendTXT(clientNum, ack);

  if (chunkState.currentChunk >= chunkState.totalChunks) {
    chunkState.file.flush();
    chunkState.file.close();

    File verify = LittleFS.open(chunkState.filename, "r");
    if (verify) {
      size_t actualSize = verify.size();
      verify.close();
      if (actualSize != chunkState.totalSize) {
        Serial.printf("ul: Warning: file size mismatch! expected %d, got %d\n", chunkState.totalSize, actualSize);
      }
    }

    String done = "{\"ul_ack\":{\"status\":\"complete\",\"written\":" + String(chunkState.totalSize) + "}}";
    webSocket.sendTXT(clientNum, done);
    Serial.printf("ul: Saved '%s' (%d bytes, %d chunks)\n", chunkState.filename.c_str(), chunkState.totalSize, chunkState.totalChunks);
    chunkState.active = false;
    return true;
  }
  return true;
}

void checkChunkTimeout() {
  if (!chunkState.active) return;
  uint32_t elapsed = millis() - chunkState.lastChunkTime;
  if (elapsed > CHUNK_TIMEOUT) {
    String err = chunkState.isUpload ? "{\"ul_ack\":{\"status\":\"timeout\"}}" : "{\"output\":\"dl: Transfer timeout\\n\"}";
    if (chunkState.file) {
      chunkState.file.flush();
      chunkState.file.close();
    }
    chunkState.active = false;
    chunkState.sending = false;
    if (chunkState.clientNum < 255) webSocket.sendTXT(chunkState.clientNum, err);
    Serial.printf("chunk: Timeout after %dms\n", elapsed);
  }
}

// ========== LLM 回调函数 ==========
void on_llm_token(const char* token, void* user_data) {
  uint8_t* client_id = (uint8_t*)user_data;
  if (*client_id < 255) {
    String json = "{\"output\":\"";
    const char* p = token;
    while (*p) {
      switch (*p) {
        case '\\': json += "\\\\"; break;
        case '"': json += "\\\""; break;
        case '\n': json += "\\n"; break;
        case '\r': json += "\\r"; break;
        default: json += *p; break;
      }
      p++;
    }
    json += "\"}";
    webSocket.sendTXT(*client_id, json);
  }
  Serial.print(token);
}

void on_llm_done(float tps, void* user_data) {
  uint8_t* client_id = (uint8_t*)user_data;
  llmGenerationActive = false;
  if (*client_id < 255) {
    String json = "{\"output\":\"\\nllama: Done: " + String(tps, 1) + " tok/s\\n\"}";
    webSocket.sendTXT(*client_id, json);
  }
  Serial.printf("\nllama: Done: %.1f tok/s\n", tps);
}

bool executeScriptLine(const String& line, const std::vector<String>& lines, int& lineIdx, String& output, bool& shouldBreak, bool& shouldContinue) {
  shouldBreak = shouldContinue = false;
  String trimmed = line;
  trimmed.trim();
  if (trimmed.isEmpty() || trimmed.startsWith("#")) return true;
  String processed = substituteVariables(trimmed);
  if (processed == "break") {
    shouldBreak = true;
    return true;
  }
  if (processed == "continue") {
    shouldContinue = true;
    return true;
  }
  if (processed.startsWith("read ")) {
    String varName = processed.substring(5);
    varName.trim();
    if (varName.isEmpty()) {
      output += "  > script: Error: read requires a variable name\n";
      return true;
    }
    scriptReadInput(varName, output);
    return true;
  }
  if (processed == "sleep" || processed.startsWith("sleep ")) {
    String arg = (processed == "sleep") ? "" : processed.substring(6);
    arg.trim();
    if (arg.isEmpty()) {
      output += "  > sleep: Usage: sleep <seconds> or <milliseconds>ms\n";
      return true;
    }
    unsigned long delayMs = arg.endsWith("ms") ? arg.substring(0, arg.length() - 2).toInt() : arg.toInt() * 1000;
    output += "  > sleep: Waiting " + arg + "...\n";
    for (unsigned long elapsed = 0; elapsed < delayMs; elapsed += 50) {
      delay(min((unsigned long)50, delayMs - elapsed));
      yield();
    }
    return true;
  }
  if (processed.startsWith("set ")) {
    String assign = processed.substring(4);
    int eqPos = assign.indexOf('=');
    if (eqPos != -1) {
      String var = assign.substring(0, eqPos), val = assign.substring(eqPos + 1);
      var.trim();
      val.trim();
      int calcResult = calculateExpression(val);
      bool isExpr = containsAnyChar(val, "+-*/%()");
      scriptVars[var] = (isExpr || val == String(calcResult)) ? String(calcResult) : (val.startsWith("\"") && val.endsWith("\"") ? val.substring(1, val.length() - 1) : val);
    }
    return true;
  }
  if (processed.startsWith("if ")) {
    // —— 收集 if / elif / else 分支 ————
    int fiLine = findBlockEndEx(lines, lineIdx + 1, "fi");
    if (fiLine == -1) {
      output += "  > script: Error: missing 'fi'\n";
      return false;
    }

    struct Branch { int line; String cond; };
    std::vector<Branch> branches;

    // 第一条分支: if
    String cond0 = processed.substring(3);
    int thenPos0 = cond0.indexOf(" then");
    if (thenPos0 != -1) cond0 = cond0.substring(0, thenPos0);
    cond0.trim();
    branches.push_back({lineIdx, substituteVariables(cond0)});

    // 扫描 elif / else
    for (int j = lineIdx + 1; j < fiLine; j++) {
      String temp = lines[j];
      temp.trim();
      if (temp.startsWith("elif ")) {
        String elifCond = temp.substring(5);
        int tp = elifCond.indexOf(" then");
        if (tp != -1) elifCond = elifCond.substring(0, tp);
        elifCond.trim();
        branches.push_back({j, substituteVariables(elifCond)});
      } else if (temp == "else") {
        branches.push_back({j, "1"});  // else 条件恒真
      }
    }

    // 执行第一个满足条件的分支
    for (int b = 0; b < (int)branches.size(); b++) {
      if (evaluateCondition(branches[b].cond)) {
        int blockStart = branches[b].line + 1;
        int blockEnd   = (b + 1 < (int)branches.size()) ? branches[b + 1].line : fiLine;
        executeScriptBlockEx(lines, blockStart, blockEnd, output);
        break;
      }
    }

