Haico-CC/ESP32-Qinux/ESP32-Qinux.ino
    lineIdx = fiLine;
    return true;
  }
  if (processed.startsWith("while ")) {
    // 条件从 trimmed (未替换) 提取，保留 $var 引用以供每轮迭代重新求值
    String condition = trimmed.substring(6);
    int doPos = condition.indexOf(" do");
    if (doPos != -1) condition = condition.substring(0, doPos);
    condition.trim();
    int doneLine = findBlockEndEx(lines, lineIdx + 1, "done");
    if (doneLine == -1) {
      output += "  > script: Error: missing 'done' for while\n";
      return false;
    }
    for (int iter = 0; iter < 500; iter++) {
      if (!evaluateCondition(substituteVariables(condition))) break;
      bool loopBreak = false, loopContinue = false;
      executeScriptBlockEx(lines, lineIdx + 1, doneLine, output, &loopBreak, &loopContinue);
      if (loopBreak) break;
      if (loopContinue) {
        yield();
        continue;
      }
      yield();
    }
    lineIdx = doneLine;
    return true;
  }
  if (processed.startsWith("for ")) {
    String rest = processed.substring(4);
    int inPos = rest.indexOf(" in "), doPos = rest.indexOf(" do");
    if (inPos == -1 || doPos == -1) {
      output += "  > script: Syntax error: invalid for loop\n";
      return false;
    }
    String varName = rest.substring(0, inPos), range = rest.substring(inPos + 4, doPos);
    varName.trim();
    range.trim();
    int dotPos = range.indexOf("..");
    if (dotPos == -1) {
      output += "  > script: Syntax error: use 'for i in 1..5 do'\n";
      return false;
    }
    int start = calculateExpression(substituteVariables(range.substring(0, dotPos)));
    int end = calculateExpression(substituteVariables(range.substring(dotPos + 2)));
    int doneLine = findBlockEndEx(lines, lineIdx + 1, "done");
    if (doneLine == -1) {
      output += "  > script: Error: missing 'done'\n";
      return false;
    }
    // 支持递增和递减范围
    if (start <= end) {
      for (int j = start; j <= end; j++) {
        scriptVars[varName] = String(j);
        bool loopBreak = false, loopContinue = false;
        executeScriptBlockEx(lines, lineIdx + 1, doneLine, output, &loopBreak, &loopContinue);
        if (loopBreak) break;
        if (loopContinue) continue;
        yield();
      }
    } else {
      for (int j = start; j >= end; j--) {
        scriptVars[varName] = String(j);
        bool loopBreak = false, loopContinue = false;
        executeScriptBlockEx(lines, lineIdx + 1, doneLine, output, &loopBreak, &loopContinue);
        if (loopBreak) break;
        if (loopContinue) continue;
        yield();
      }
    }
    lineIdx = doneLine;
    return true;
  }
  String cmdOutput, dummyPrompt, dummyDlF, dummyDlC;
  bool dummyClear, dummyUl;
  executeCommand(processed, cmdOutput, dummyPrompt, dummyClear, dummyDlF, dummyDlC, dummyUl);
  if (!cmdOutput.isEmpty()) {
    output += "  > ";
    int start = 0;
    for (size_t i = 0; i < cmdOutput.length(); i++) {
      if (cmdOutput[i] == '\n') {
        output += cmdOutput.substring(start, i + 1);
        if (i + 1 < cmdOutput.length()) output += "  > ";
        start = i + 1;
      }
    }
    if (start < cmdOutput.length()) output += cmdOutput.substring(start);
  }
  return true;
}

void executeScriptBlockEx(const std::vector<String>& lines, int startLine, int endLine, String& output, bool* outBreak, bool* outContinue) {
  if (startLine < 0 || endLine > (int)lines.size() || startLine >= endLine) {
    output += "  > script: Error: invalid block range\n";
    return;
  }
  for (int i = startLine; i < endLine;) {
    if (i < 0 || i >= (int)lines.size()) break;
    bool shouldBreak = false, shouldContinue = false;
    if (!executeScriptLine(lines[i], lines, i, output, shouldBreak, shouldContinue)) break;
    if (shouldContinue) {
      if (outContinue) *outContinue = true;
      return;
    }
    if (shouldBreak) {
      if (outBreak) *outBreak = true;
      return;
    }
    i++;
  }
}

// ========== HTML前端内容（含Web编辑器）==========
const char HTML_CONTENT[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ESP32-QINUX Terminal</title>
    <style>
        * { margin: 0; padding: 0; box-sizing: border-box; }
        body { background: #000; display: flex; justify-content: center; align-items: center; min-height: 100vh; font-family: 'Courier New', monospace; overflow: hidden; transition: background 0.3s; }
        body.matrix-active { background: #000 !important; }
        .crt { width: 95vw; max-width: 1200px; aspect-ratio: 4 / 3; max-height: 92vh; background: #1a1a1a; border-radius: 20px; padding: clamp(10px, 2vw, 30px); box-shadow: 0 0 50px rgba(0, 255, 0, 0.15), inset 0 0 20px rgba(0, 0, 0, 0.8); position: relative; display: flex; flex-direction: column; }
        .screen { flex: 1; width: 100%; background: #000000; border: 3px solid #003300; border-radius: 10px; padding: clamp(5px, 1.5vw, 15px); color: #00ff00; font-size: clamp(9px, 1.4vw, 18px); line-height: 1.2; position: relative; overflow: hidden; text-shadow: 0 0 clamp(1px, 0.3vw, 3px) #00ff00; display: flex; flex-direction: column; }
        .scanline { position: absolute; top: 0; left: 0; width: 100%; height: 100%; background: linear-gradient(to bottom, transparent 50%, rgba(0, 30, 0, 0.25) 50%); background-size: 100% clamp(4px, 1vw, 8px); pointer-events: none; animation: scan 4s linear infinite; z-index: 1; }
        .screen::after { content: ''; position: absolute; top: 0; left: 0; width: 100%; height: 100%; background: rgba(0, 255, 0, 0.02); pointer-events: none; animation: flicker 0.15s infinite alternate; z-index: 1; }
        @keyframes scan { 0% { transform: translateY(0); } 100% { transform: translateY(-4px); } }
        @keyframes flicker { 0% { opacity: 0.97; } 100% { opacity: 1; } }
        #output { flex: 1; width: 100%; overflow-y: auto; white-space: pre-wrap; word-wrap: break-word; margin-bottom: clamp(5px, 1vw, 10px); z-index: 2; position: relative; }
        #output::-webkit-scrollbar { width: clamp(4px, 0.8vw, 8px); }
        #output::-webkit-scrollbar-thumb { background: #005500; border-radius: 3px; }
        .input-line { display: flex; align-items: center; width: 100%; flex-shrink: 0; z-index: 2; position: relative; }
        .prompt { color: #00ff00; margin-right: clamp(4px, 0.5vw, 8px); flex-shrink: 0; }
        #input { flex: 1; background: transparent; border: none; outline: none; color: #00ff00; font-family: 'Courier New', monospace; font-size: inherit; text-shadow: 0 0 clamp(1px, 0.3vw, 3px) #00ff00; }
        #hiddenFileInput { display: none; }
        #matrix-canvas { position: absolute; top: 0; left: 0; width: 100%; height: 100%; background: #000; z-index: 10; display: none; }
        .matrix-active #output, .matrix-active .input-line { display: none !important; }
        .cat-container { position: fixed; top: 0; left: 0; width: 100vw; height: 100vh; background: #000; overflow: hidden; z-index: 150; display: none; pointer-events: none; }
        .falling-cat { position: absolute; top: -10%; animation: fall linear forwards; will-change: transform, opacity; user-select: none; pointer-events: none; filter: drop-shadow(0 0 2px rgba(0,255,0,0.3)); }
        @keyframes fall { 0% { transform: translateY(0) rotate(-10deg); opacity: 0; } 5% { opacity: 0.9; } 95% { opacity: 0.9; } 100% { transform: translateY(115vh) rotate(20deg); opacity: 0; } }
        .cat-active .crt { display: none !important; }
        .cat-active body { background: #000 !important; }
        .fortune-text { color: #00ff88; font-style: italic; text-shadow: 0 0 5px #00ff88; animation: glow 2s ease-in-out infinite alternate; display: block; margin: 4px 0; }
        @keyframes glow { from { text-shadow: 0 0 3px #00ff88; } to { text-shadow: 0 0 15px #00ff88, 0 0 30px #00aa55; } }
        .exit-hint { position: fixed; bottom: 20px; left: 50%; transform: translateX(-50%); color: #0f0; background: rgba(0, 20, 0, 0.85); padding: 8px 16px; border-radius: 4px; z-index: 200; font-size: clamp(10px, 2vw, 14px); border: 1px solid #005500; animation: hintFade 3s forwards; }
        @keyframes hintFade { 0%, 80% { opacity: 1; } 100% { opacity: 0; } }
        /* 编辑器样式 */
        #editorContainer { display: none; flex: 1; flex-direction: column; z-index: 3; position: relative; }
        #editorToolbar { display: flex; justify-content: space-between; align-items: center; padding: 4px 0; }
        #editorFilename { color: #0f0; }
        #editorTextarea { flex: 1; width: 100%; background: #000; color: #0f0; border: 1px solid #0f0; font-family: 'Courier New', monospace; font-size: inherit; line-height: 1.2; text-shadow: 0 0 3px #00ff00; resize: none; padding: 5px; box-sizing: border-box; }
        #editorSaveBtn { background: #0a0; color: #000; border: none; padding: 2px 8px; cursor: pointer; }
        #editorCancelBtn { background: #a00; color: #fff; border: none; padding: 2px 8px; cursor: pointer; }
        #editorSaveBtn:hover { background: #0f0; }
        #editorCancelBtn:hover { background: #f00; }
        #editorCursorPos { color: #0a0; margin-right: 10px; font-size: 0.85em; }
        #editorHints { color: #080; margin-right: 10px; font-size: 0.8em; }
    </style>
</head>
<body>
    <input type="file" id="hiddenFileInput">
    <canvas id="matrix-canvas"></canvas>
    <div class="cat-container" id="catContainer"></div>
    <div class="crt">
        <div class="screen">
            <div class="scanline"></div>
            <div id="output"></div>
            <div class="input-line">
                <span class="prompt" id="prompt">root@esp32:/# </span>
                <input type="text" id="input" autocomplete="off" autofocus>
            </div>
            <div id="editorContainer">
                <div id="editorToolbar">
                    <span id="editorFilename"></span>
                    <div>
                        <span id="editorHints">Ctrl+S Save · Esc Cancel</span>
                        <span id="editorCursorPos">Ln 1, Col 1</span>
                        <button id="editorSaveBtn">Save</button>
                        <button id="editorCancelBtn">Cancel</button>
                    </div>
                </div>
                <textarea id="editorTextarea"></textarea>
            </div>
        </div>
    </div>
    <script>
        const output = document.getElementById('output');
        const input = document.getElementById('input');
        const prompt = document.getElementById('prompt');
        const fileInput = document.getElementById('hiddenFileInput');
        const catContainer = document.getElementById('catContainer');
        const matrixCanvas = document.getElementById('matrix-canvas');
        const matrixCtx = matrixCanvas.getContext('2d');
        const CHUNK_SIZE = 4096;
        let ws;
        let matrixInterval = null;
        let catSpawnInterval = null;
        const CAT_EMOJIS = ['🐱', '😺', '😸', '😻', '😽', '🙀', '😿', '😾', '🐈', '🐈‍⬛', '🐾'];
        const cmdHistory = [];
        let histPos = -1;
        let isEditingMode = false;       // 终端逐行编辑模式（EOF退出）
        let isEditorMode = false;        // Web 全屏编辑器模式
        let currentEditFilename = '';
        let lastDlProg = -1;
        let lastUlProg = -1;

        // 编辑器相关 DOM
        const editorContainer = document.getElementById('editorContainer');
        const editorTextarea = document.getElementById('editorTextarea');
        const editorFilename = document.getElementById('editorFilename');
        const editorSaveBtn = document.getElementById('editorSaveBtn');
        const editorCancelBtn = document.getElementById('editorCancelBtn');
        const editorCursorPos = document.getElementById('editorCursorPos');

        function enterEditorMode(filename, content) {
            document.querySelector('.input-line').style.display = 'none';
            editorContainer.style.display = 'flex';
            editorFilename.textContent = filename;
            editorTextarea.value = content;
            currentEditFilename = filename;
            isEditorMode = true;
            editorTextarea.focus();
        }

        function exitEditorMode() {
            document.querySelector('.input-line').style.display = 'flex';
            editorContainer.style.display = 'none';
            isEditorMode = false;
            currentEditFilename = '';
            input.focus();
        }

