Haico-CC/ESP32-Qinux/ESP32-Qinux.ino
        editorSaveBtn.addEventListener('click', () => {
            if (!isEditorMode) return;
            const content = editorTextarea.value;
            // 使用 TextEncoder 将 JS 字符串正确编码为 UTF-8 字节
            const encoder = new TextEncoder();
            const utf8Bytes = encoder.encode(content);
            let binary = '';
            for (let i = 0; i < utf8Bytes.length; i++) {
                binary += String.fromCharCode(utf8Bytes[i]);
            }
            const b64 = btoa(binary);
            ws.send('__EDIT_SAVE__:' + currentEditFilename + ':' + b64);
            exitEditorMode();
        });

        editorCancelBtn.addEventListener('click', () => {
            exitEditorMode();
        });

        editorTextarea.addEventListener('keydown', (e) => {
            // Ctrl+S / Cmd+S → 保存
            if ((e.ctrlKey || e.metaKey) && e.key === 's') {
                e.preventDefault();
                editorSaveBtn.click();
                return;
            }
            // Escape → 取消
            if (e.key === 'Escape') {
                e.preventDefault();
                editorCancelBtn.click();
                return;
            }
            if (e.key === 'Tab') {
                e.preventDefault();
                const start = editorTextarea.selectionStart;
                const end = editorTextarea.selectionEnd;
                editorTextarea.value = editorTextarea.value.substring(0, start) + '\t' + editorTextarea.value.substring(end);
                editorTextarea.selectionStart = editorTextarea.selectionEnd = start + 1;
            }
        });

        function updateCursorPos() {
            const text = editorTextarea.value;
            const pos = editorTextarea.selectionStart;
            let line = 1, col = 1;
            for (let i = 0; i < pos; i++) {
                if (text[i] === '\n') { line++; col = 1; }
                else col++;
            }
            editorCursorPos.textContent = 'Ln ' + line + ', Col ' + col;
        }
        editorTextarea.addEventListener('keyup', updateCursorPos);
        editorTextarea.addEventListener('click', updateCursorPos);

        function showExitHint(text) {
            const existing = document.querySelector('.exit-hint');
            if (existing) existing.remove();
            const hint = document.createElement('div');
            hint.className = 'exit-hint';
            hint.textContent = text;
            document.body.appendChild(hint);
            setTimeout(() => { if (hint.parentNode) hint.remove(); }, 3000);
        }

        function startMatrix() {
            matrixCanvas.width = window.innerWidth;
            matrixCanvas.height = window.innerHeight;
            const chars = '01ﾠﾡ￡￢￥￤￦￧￨￩￪￫￬￭｡｢｣､･ｦｧｨｩｪｫｬｭｮｯｰｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜﾝ1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ';
            const fontSize = 14;
            const columns = Math.floor(matrixCanvas.width / fontSize);
            const drops = [];
            for (let i = 0; i < columns; i++) drops[i] = Math.random() * -100;
            document.body.classList.add('matrix-active');
            matrixCanvas.style.display = 'block';
            showExitHint("Press any key / Click / ESC to exit Matrix");
            function draw() {
                matrixCtx.fillStyle = 'rgba(0, 0, 0, 0.05)';
                matrixCtx.fillRect(0, 0, matrixCanvas.width, matrixCanvas.height);
                matrixCtx.fillStyle = '#0f0';
                matrixCtx.font = fontSize + 'px monospace';
                for (let i = 0; i < drops.length; i++) {
                    matrixCtx.fillText(chars.charAt(Math.floor(Math.random() * chars.length)), i * fontSize, drops[i] * fontSize);
                    if (drops[i] * fontSize > matrixCanvas.height && Math.random() > 0.975) drops[i] = 0;
                    drops[i]++;
                }
            }
            matrixInterval = setInterval(draw, 33);
            const exitHandler = (e) => {
                if (['Escape', 'Enter', ' '].includes(e.key) || e.type === 'click') {
                    e.preventDefault();
                    stopMatrix();
                    document.removeEventListener('keydown', exitHandler);
                    document.removeEventListener('click', exitHandler);
                }
            };
            document.addEventListener('keydown', exitHandler);
            document.addEventListener('click', exitHandler);
        }
        function stopMatrix() {
            if (matrixInterval) { clearInterval(matrixInterval); matrixInterval = null; }
            matrixCanvas.style.display = 'none';
            document.body.classList.remove('matrix-active');
            input.focus();
        }
        function startCatEasterEgg() {
            catContainer.innerHTML = '';
            document.body.classList.add('cat-active');
            catContainer.style.display = 'block';
            showExitHint("Click anywhere or press any key to stop the cats 🐱");
            for(let i=0; i<10; i++) setTimeout(spawnCat, i * 50);
            catSpawnInterval = setInterval(spawnCat, 100);
            const exitHandler = (e) => {
                e.preventDefault?.();
                stopCatEasterEgg();
                document.removeEventListener('click', exitHandler);
                document.removeEventListener('keydown', exitHandler);
            };
            document.addEventListener('click', exitHandler);
            document.addEventListener('keydown', exitHandler);
        }
        function spawnCat() {
            const cat = document.createElement('div');
            cat.className = 'falling-cat';
            cat.textContent = CAT_EMOJIS[Math.floor(Math.random() * CAT_EMOJIS.length)];
            const left = Math.random() * 100;
            const size = Math.random() * 40 + 24;
            const duration = Math.random() * 2.5 + 2.5;
            const delay = Math.random() * 0.2;
            cat.style.left = `${left}%`;
            cat.style.fontSize = `${size}px`;
            cat.style.animationDuration = `${duration}s`;
            cat.style.animationDelay = `${delay}s`;
            cat.style.opacity = Math.random() * 0.3 + 0.7;
            cat.addEventListener('animationend', () => cat.remove());
            catContainer.appendChild(cat);
        }
        function stopCatEasterEgg() {
            if (catSpawnInterval) { clearInterval(catSpawnInterval); catSpawnInterval = null; }
            catContainer.innerHTML = '';
            document.body.classList.remove('cat-active');
            catContainer.style.display = 'none';
            input.focus();
        }
        function renderFortune(text) {
            const clean = text.trim().replace(/^"|"$/g, '');
            return `<span class="fortune-text"> ${clean}</span>\n`;
        }
        function formatBytes(bytes) {
            if (bytes < 1024) return bytes + ' B';
            if (bytes < 1024*1024) return (bytes/1024).toFixed(1) + ' KB';
            return (bytes/1024/1024).toFixed(1) + ' MB';
        }
        function handleDownloadStart(info) {
            window.dlBuffer = new Uint8Array(info.size);
            window.dlReceived = 0;
            window.dlFilename = info.filename;
            window.dlTotal = info.size;
            window.dlChunkSize = info.chunk_size || CHUNK_SIZE;
            lastDlProg = -1;
            output.textContent += `dl: Starting: ${info.filename} (${formatBytes(info.size)})\n`;
            output.scrollTop = output.scrollHeight;
        }
        function handleDownloadChunk(chunk) {
            if (!window.dlBuffer) return;
            try {
                const offset = chunk.index * (chunk.chunk_size || CHUNK_SIZE);
                const binary = atob(chunk.data);
                for (let i = 0; i < binary.length; i++) { window.dlBuffer[offset + i] = binary.charCodeAt(i); }
                window.dlReceived += chunk.size;
                let prog = chunk.progress || Math.floor(window.dlReceived * 100 / window.dlTotal);
                let step = Math.floor(prog / 5);
                if (step > lastDlProg) {
                    lastDlProg = step;
                    output.textContent += `dl: Progress: ${prog}%\n`;
                    output.scrollTop = output.scrollHeight;
                }
                ws.send(`__DL_ACK__:${chunk.index}`);
            } catch(e) {
                output.textContent += `dl: Error: ${e.message}\n`;
                output.textContent += `dl: Reconnecting...\n`;
                output.scrollTop = output.scrollHeight;
                setTimeout(() => connect(), 1000);
            }
        }
        function handleDownloadEnd(info) {
            if (!window.dlBuffer) return;
            const blob = new Blob([window.dlBuffer]);
            const url = URL.createObjectURL(blob);
            const a = document.createElement('a');
            a.href = url;
            a.download = window.dlFilename;
            document.body.appendChild(a);
            a.click();
            document.body.removeChild(a);
            URL.revokeObjectURL(url);
            output.textContent += `dl: Complete: ${window.dlFilename}\n`;
            output.scrollTop = output.scrollHeight;
            delete window.dlBuffer;
        }
        function startChunkedUpload(file) {
            const reader = new FileReader();
            const chunkSize = CHUNK_SIZE;
            let offset = 0;
            lastUlProg = -1;
            output.textContent += `ul: Starting: ${file.name} (${formatBytes(file.size)})\n`;
            output.scrollTop = output.scrollHeight;
            ws.send(`__UPLOAD_START__:filename:${file.name},size:${file.size},chunk_size:${chunkSize}`);
            function sendNextChunk() {
                if (offset >= file.size) {
                    ws.send(`__UPLOAD_END__`);
                    output.textContent += `ul: Saving file...\n`;
                    output.scrollTop = output.scrollHeight;
                    return;
                }
                const end = Math.min(offset + chunkSize, file.size);
                const slice = file.slice(offset, end);
                reader.onload = (e) => {
                    const arr = new Uint8Array(e.target.result);
                    let binary = '';
                    for (let i = 0; i < arr.length; i++) binary += String.fromCharCode(arr[i]);
                    const b64 = btoa(binary);
                    ws.send(`__UPLOAD_CHUNK__:index:${Math.floor(offset/chunkSize)},${b64}`);
                    offset = end;
                    let prog = Math.floor(offset * 100 / file.size);
                    let step = Math.floor(prog / 5);
                    if (step > lastUlProg) {
                        lastUlProg = step;
                        output.textContent += `ul: Progress: ${prog}%\n`;
                        output.scrollTop = output.scrollHeight;
                    }
                    setTimeout(sendNextChunk, 50);
                };
                reader.readAsArrayBuffer(slice);
            }
            sendNextChunk();
        }
        function connect() {
            const protocol = window.location.protocol === 'https:' ? 'wss:' : 'ws:';
            ws = new WebSocket(`${protocol}//${window.location.hostname}:81`);
            ws.onopen = () => {
                output.textContent += "=== ESP32-CINUX SYSTEM CONNECTED ===\n";
                output.textContent += "Type 'help' for command list\n\n";
                output.scrollTop = output.scrollHeight;
                syncTime();
            };
            ws.onmessage = (evt) => {
                try {
                    const data = JSON.parse(evt.data);
                    if (data.edit_start) {
                        enterEditorMode(data.edit_start.filename, data.edit_start.content);
                        return;
                    }
                    if (data.dl_start) { handleDownloadStart(data.dl_start); return; }
                    if (data.dl_chunk) { handleDownloadChunk(data.dl_chunk); return; }
                    if (data.dl_end) { handleDownloadEnd(data.dl_end); return; }
                    if (data.ul_ack) {
                        if (data.ul_ack.status === 'error') {
                            output.textContent += `ul: Error: ${data.ul_ack.msg}\n`;
                            output.scrollTop = output.scrollHeight;
                        } else if (data.ul_ack.status === 'complete') {
                            output.textContent += `ul: Saved: ${data.ul_ack.written} bytes\n`;
                            output.scrollTop = output.scrollHeight;
                        }
                        return;
                    }
                    if (data.output) {
                        if(data.output.includes("edit: Type 'EOF' to save & exit")) isEditingMode = true;
                        if(data.output.includes("edit: File saved")) isEditingMode = false;
                        if (data.output.includes("__MATRIX_MODE__")) { startMatrix(); return; }
                        if (data.output.includes("__CAT_EASTER_EGG__")) { startCatEasterEgg(); return; }
                        if (data.prompt && data.prompt.includes("fortune")) output.textContent += renderFortune(data.output);
                        else output.textContent += data.output;
                        output.scrollTop = output.scrollHeight;
                    }
                    if (data.prompt) prompt.textContent = data.prompt;
                    if (data.clear) output.textContent = '';
                    if (data.download) {
                        const { filename, content } = data.download;
                        try {
                            const byteCharacters = atob(content);
                            const byteNumbers = new Array(byteCharacters.length);
                            for (let i = 0; i < byteCharacters.length; i++) byteNumbers[i] = byteCharacters.charCodeAt(i);
                            const blob = new Blob([new Uint8Array(byteNumbers)]);
                            const url = URL.createObjectURL(blob);
                            const a = document.createElement('a'); a.href = url; a.download = filename;
                            document.body.appendChild(a); a.click(); document.body.removeChild(a);
                            URL.revokeObjectURL(url);
                        } catch(e) { output.textContent += "[ERR] Download failed: " + e.message + "\n"; output.scrollTop = output.scrollHeight; }
                    }
                    if (data.upload) fileInput.click();
                } catch (e) { output.textContent += "[ERR] Message parse failed\n"; output.scrollTop = output.scrollHeight; }
            };
            ws.onclose = () => { output.textContent += "\n=== CONNECTION LOST - RECONNECTING ===\n"; output.scrollTop = output.scrollHeight; setTimeout(connect, 2000); };
            ws.onerror = (err) => console.error("WebSocket error:", err);
        }
        fileInput.addEventListener('change', (e) => {
            const file = e.target.files[0];
            if (!file) return;
            startChunkedUpload(file);
            e.target.value = '';
        });
        function syncTime() { ws.send(`__SYNC_TIME__:${Math.floor(Date.now() / 1000)}`); }
        input.addEventListener('keydown', (e) => {
            if (isEditorMode) return;
            if (e.key === 'Enter') {
                const cmd = input.value;
                if(isEditingMode) output.textContent += cmd + '\n';
                else output.textContent += prompt.textContent + cmd + '\n';
                output.scrollTop = output.scrollHeight;
                if (cmd.trim()) ws.send(cmd);
                if (cmd.trim() && !document.body.classList.contains('matrix-active') && !document.body.classList.contains('cat-active')) {
                    cmdHistory.push(cmd);
                    histPos = -1;
                }
                input.value = '';
            }
            if (e.key === 'ArrowUp') {
                e.preventDefault();
                if (cmdHistory.length > 0) {
                    histPos = Math.min(histPos + 1, cmdHistory.length - 1);
                    input.value = cmdHistory[cmdHistory.length - 1 - histPos];
                }
            }
            if (e.key === 'ArrowDown') {
                e.preventDefault();
                if (histPos > 0) {
                    histPos--;
                    input.value = cmdHistory[cmdHistory.length - 1 - histPos];
                } else if (histPos === 0) {
                    histPos = -1;
                    input.value = '';
                }
            }
            if (document.body.classList.contains('matrix-active') || document.body.classList.contains('cat-active')) e.stopPropagation();
        });
        document.querySelector('.screen').addEventListener('click', (e) => {
            if (!document.body.classList.contains('matrix-active') && !document.body.classList.contains('cat-active')) input.focus();
        });
        window.addEventListener('resize', () => {
            if (matrixCanvas.style.display !== 'none') { matrixCanvas.width = window.innerWidth; matrixCanvas.height = window.innerHeight; }
        });
        document.addEventListener('touchmove', (e) => {
            if (document.body.classList.contains('matrix-active') || document.body.classList.contains('cat-active')) e.preventDefault();
        }, { passive: false });
        connect();
    </script>
</body>
</html>
)rawliteral";

// ========== 核心命令执行函数 ==========
void executeCommand(String cmd, String& output, String& newPrompt, bool& clearTerminal, String& dlFileName, String& dlContent, bool& triggerUpload) {
  output = "";
  newPrompt = "root@esp32:" + currentPath + "# ";
  clearTerminal = false;
  dlFileName = "";
  dlContent = "";
  triggerUpload = false;
  g_lastExitCode = 0;

