Haico-CC/ESP32-Qinux/ESP32-Qinux.ino
  // 串口逐行编辑模式（Web端不会进入此分支）
  if (isEditing) {
    newPrompt = "";
    if (cmd == "EOF") {
      isEditing = false;
      newPrompt = "root@esp32:" + currentPath + "# ";
      output = "\nedit: File saved: " + editingFilePath + "\n";
      editingFilePath = "";
      return;
    }
    if (!canWritePath(editingFilePath)) {
      output = "edit: Permission denied: '" + editingFilePath + "' is protected\n";
      isEditing = false;
      newPrompt = "root@esp32:" + currentPath + "# ";
      editingFilePath = "";
      return;
    }
    File f = LittleFS.open(editingFilePath, "a");
    if (f) {
      f.println(cmd);
      f.close();
      output = "";
    } else {
      output = "edit: Error: Failed to write file!\n";
      isEditing = false;
      newPrompt = "root@esp32:" + currentPath + "# ";
      editingFilePath = "";
    }
    return;
  }

  if (cmd.startsWith("__SYNC_TIME__:")) {
    setSystemTime(cmd.substring(14).toInt());
    output = "time: Browser time applied to ESP32 RTC.\n";
    return;
  }

  // ========== llama 命令处理 ==========
  if (cmd == "llama init" || cmd.startsWith("llama init ")) {
    String modelPath = LLM_MODEL_PATH;
    String tokenPath = LLM_TOKEN_PATH;
    if (cmd.startsWith("llama init ")) {
      String args = cmd.substring(10);
      args.trim();
      int spacePos = args.indexOf(' ');
      if (spacePos == -1) {
        output = "llama: Error: init requires 2 arguments\n";
        output += "llama: Usage: llama init <model.bin> <tokens.bin>\n";
        output += "llama: Example: llama init models/my.bin tokens/tok.bin\n";
        output += "llama: Or use 'llama init' for default /bin/ models\n";
        return;
      }
      modelPath = args.substring(0, spacePos);
      tokenPath = args.substring(spacePos + 1);
      modelPath.trim();
      tokenPath.trim();
      if (!modelPath.startsWith("/")) modelPath = resolvePath(modelPath);
      if (!tokenPath.startsWith("/")) tokenPath = resolvePath(tokenPath);
    }
    if (!LittleFS.exists(modelPath)) {
      output = "llama: Model not found: " + modelPath + "\n";
      return;
    }
    if (!LittleFS.exists(tokenPath)) {
      output = "llama: Token file not found: " + tokenPath + "\n";
      return;
    }
    if (llm_bridge_init(modelPath.c_str(), tokenPath.c_str())) {
      output = "llama: Model loaded: " + modelPath + "\n";
      output += "llama: Tokens: " + tokenPath + "\n";
    } else {
      output = "llama: Init failed. Check serial logs.\n";
    }
    return;
  }
  if (cmd == "llama status") {
    if (!llm_bridge_is_ready()) output = "llama: Status: Not initialized\n";
    else if (llm_bridge_is_busy()) output = "llama: Status: Generating...\n";
    else output = "llama: Status: Ready\n";
    return;
  }
  if (cmd == "llama free") {
    if (!llm_bridge_is_ready()) {
      output = "llama: Not initialized\n";
      return;
    }
    llm_bridge_free();
    output = "llama: Model unloaded. PSRAM freed.\n";
    return;
  }
  if (cmd.startsWith("llama ")) {
    String args = cmd.substring(6);
    args.trim();
    if (!llm_bridge_is_ready()) {
      output = "llama: Run 'llama init' first\n";
      return;
    }
    if (llm_bridge_is_busy()) {
      output = "llama: Busy generating.\n";
      return;
    }
    String prompt = "";
    bool hasQuotes = false;
    int promptEnd = -1;
    if (args.length() >= 2) {
      if (args.startsWith("\"")) {
        for (int i = 1; i < args.length(); i++) {
          if (args[i] == '"' && (i == 1 || args[i - 1] != '\\')) {
            prompt = args.substring(1, i);
            promptEnd = i + 1;
            hasQuotes = true;
            break;
          }
        }
      } else if (args.startsWith("'")) {
        for (int i = 1; i < args.length(); i++) {
          if (args[i] == '\'' && (i == 1 || args[i - 1] != '\\')) {
            prompt = args.substring(1, i);
            promptEnd = i + 1;
            hasQuotes = true;
            break;
          }
        }
      }
    }
    if (!hasQuotes) {
      output = "llama: Error: Prompt must be enclosed in quotes\n";
      output += "llama: Usage: llama \"<your prompt>\" [-l N]\n";
      output += "llama: Examples:\n";
      output += "* llama \"Hello world\"\n";
      output += "* llama 'Ask me anything' -l 100\n";
      output += "* llama -l 50 \"Short reply\"\n";
      output += "llama: Note: Prompt MUST be enclosed in quotes\n";
      return;
    }
    int max_len = 256;
    if (promptEnd >= 0 && promptEnd < args.length()) {
      String rest = args.substring(promptEnd);
      rest.trim();
      int lPos = rest.indexOf("-l ");
      if (lPos == -1) lPos = rest.indexOf("-l");
      if (lPos != -1) {
        String numPart = rest.substring(lPos + 2);
        numPart.trim();
        String numStr = "";
        for (int i = 0; i < numPart.length(); i++) {
          if (isdigit(numPart[i]) || (numPart[i] == '-' && i == 0)) numStr += numPart[i];
          else break;
        }
        int parsed = numStr.toInt();
        if (parsed > 0 && parsed <= 2048) max_len = parsed;
      }
    }
    if (!prompt.isEmpty() && prompt.charAt(prompt.length() - 1) != ' ') prompt += " ";
    if (prompt.isEmpty()) {
      output = "llama: Error: Empty prompt\n";
      return;
    }
    llm_bridge_generate(prompt.c_str(), max_len, on_llm_token, on_llm_done, &llmActiveClient);
    return;
  }

  if (cmd == "help") {
    output += "SHELL BUILTINS & NAVIGATION\n----------------------------\n";
    output += "  help                      - Show this help message\n";
    output += "  pwd                       - Print current working directory path\n";
    output += "  cd <path>                 - Change current working directory to target path\n";
    output += "  ls [-l]                   - List directory contents (-l for detailed view)\n\n";
    output += "FILE SYSTEM COMMANDS\n--------------------\n";
    output += "  touch <file>              - Create a new empty file\n";
    output += "  mkdir <dir>               - Create a new empty directory\n";
    output += "  cat <file>                - Display the full content of a file\n";
    output += "  edit <file>               - Edit a file (input EOF to save and exit)\n";
    output += "  cp <src> <dst>            - Copy source file/directory to destination\n";
    output += "  mv <src> <dst>            - Move or rename a file/directory\n";
    output += "  rm [-r] <path>            - Delete file (add -r to delete directory recursively)\n";
    output += "  grep <pattern> <file>     - Search for matching text pattern in a file\n";
    output += "  echo <txt> [> file]       - Print text (redirect to file with > symbol)\n\n";
    output += "SCRIPTING SYNTAX\n----------------\n";
    output += "  run <script> [input]      - Execute script file (optional input data file)\n";
    output += "  * read <var>              - Read input line and store into variable $var\n";
    output += "  * set var=value           - Define a custom shell variable\n";
    output += "  * set var=expr            - Calculate arithmetic expression (+-*/%) and assign\n";
    output += "  * if cond then ... fi     - Conditional execution block\n";
    output += "  * if ... elif ... else ... fi - Multi-branch conditional\n";
    output += "  * for i in 1..5 do ... done - Numeric loop (iterate from 1 to 5)\n";
    output += "  * while cond do ... done  - Loop while the condition is true\n";
    output += "  * break                   - Exit the current loop immediately\n";
    output += "  * continue                - Skip to next loop iteration\n";
    output += "  * sleep <sec>|<ms>ms      - Delay execution (seconds or milliseconds)\n";
    output += "  * $?                      - Get exit code of last command (0 = success)\n";
    output += "  * # comment               - Single line comment (ignored by shell)\n\n";
    output += "SYSTEM INFO\n-------------\n";
    output += "  uname                     - Show system name and version information\n";
    output += "  cpuinfo                   - Display CPU hardware details\n";
    output += "  free                      - Show system memory usage statistics\n";
    output += "  df                        - Show disk partition space usage\n";
    output += "  sysinfo                   - Show comprehensive system information\n";
    output += "  date [-s]                 - Show/set current system date and time\n";
    output += "  reset                     - Reset terminal to default state\n\n";
    output += "WIFI MANAGEMENT (Safe)\n------------------------\n";
    output += "  wifi [status]             - Show WiFi status summary\n";
    output += "  wifi info                 - Display detailed config\n";
    output += "  wifi scan                 - Scan surrounding networks\n";
    output += "  wifi stats                - Signal quality & rates\n";
    output += "  wifi set power <dBm>      - Adjust TX power (2~20)\n\n";
    output += "LLM / AI COMMANDS\n-------------------\n";
    output += "  llama init                - Load the LLM model from /bin/\n";
    output += "  llama init <m.bin> <t.bin> - Load custom model (relative paths)\n";
    output += "  llama \"<prompt>\" [-l N] - Generate (prompt MUST be quoted)\n";
    output += "  llama 'Ask me'            - Single quotes also work\n";
    output += "  llama status              - Show LLM model status\n";
    output += "  llama free                - Unload model and free PSRAM\n";
    output += "  * Protected: /bin/ is read-only\n\n";
    output += "HARDWARE CONTROL\n------------------\n";
    output += "  gpio [-s <pin> <level>]   - View GPIO status (set pin level with -s)\n";
    output += "  adc [pin]                 - Read ADC1 value (default: GPIO4)\n";
    output += "  * Safe GPIO for this chip: " + getSafeGpioList() + "\n";
    output += "  * ADC1 pins: " + getAdc1ValidPins() + "\n\n";
    output += "FILE TRANSFER & FUN\n---------------------\n";
    output += "  dl <file>                 - Download file (supports chunked transfer up to 5MB)\n";
    output += "  ul                        - Upload file (supports chunked transfer up to 5MB)\n";
    output += "  clear                     - Clear all content in the terminal screen\n";
    output += "  matrix                    - Enter the digital rain 🌧️\n";
    output += "  fortune                   - Ask the silicon oracle for wisdom 🎱\n";
    output += "  cat                       - Try it without parameters! 🐱\n";
    return;
  }

