Haico-CC/ESP32-Qinux/ESP32-Qinux.ino
  if (cmd == "dl" || cmd.startsWith("dl ")) {
    String pathArg = (cmd == "dl") ? "" : cmd.substring(3);
    pathArg.trim();
    if (pathArg.isEmpty()) {
      output = "dl: Usage: dl <file>\n";
      return;
    }
    String fullPath = resolvePath(pathArg);
    if (!LittleFS.exists(fullPath)) {
      output = "dl: " + pathArg + ": No such file\n";
      return;
    }
    File f = LittleFS.open(fullPath, "r");
    if (f.isDirectory()) {
      output = "dl: " + pathArg + ": Is a directory\n";
      f.close();
      return;
    }
    f.close();
    if (!startChunkedDownload(fullPath, llmActiveClient)) { output = "dl: Failed to start transfer\n"; }
    return;
  }

  if (cmd == "ul") {
    triggerUpload = true;
    output = "ul: Please select a file via browser popup...\n";
    return;
  }

  if (cmd == "run" || cmd.startsWith("run ")) {
    String args = (cmd == "run") ? "" : cmd.substring(4);
    args.trim();
    int spacePos = args.indexOf(" ");
    String scriptPath = args, inputPath = "";
    if (spacePos != -1) {
      scriptPath = args.substring(0, spacePos);
      inputPath = args.substring(spacePos + 1);
      scriptPath.trim();
      inputPath.trim();
    }
    if (scriptPath.isEmpty()) {
      output = "run: Usage: run <script> [input_file]\n";
      return;
    }
    String fullPath = resolvePath(scriptPath);
    if (!LittleFS.exists(fullPath)) {
      output = "run: File not found: " + scriptPath + "\n";
      return;
    }
    File f = LittleFS.open(fullPath, "r");
    if (!f || f.isDirectory()) {
      output = "run: Not a valid file\n";
      f.close();
      return;
    }
    if (!inputPath.isEmpty() && !loadScriptInput(resolvePath(inputPath))) output += "run: Warning: Failed to load input file\n";
    else {
      scriptInputLines.clear();
      scriptInputIndex = 0;
    }
    scriptVars.clear();
    output += "---------------------------------\nrun: Executing: " + fullPath + "\n";
    if (!inputPath.isEmpty()) output += "run: With input: " + inputPath + "\n";
    output += "---------------------------------\n";
    std::vector<String> lines;
    String line;
    while (f.available()) {
      char c = f.read();
      if (c == '\n') {
        lines.push_back(line);
        line = "";
      } else if (c != '\r') line += c;
    }
    if (!line.isEmpty()) lines.push_back(line);
    f.close();
    executeScriptBlockEx(lines, 0, lines.size(), output);
    output += "---------------------------------\nrun: Completed!\n---------------------------------\n";
    return;
  }

  if (cmd == "uname") {
    output = "ESP32-QINUX v1.0\nKernel: LittleFS on ESP32\nArchitecture: Xtensa LX7\n";
    return;
  }
  if (cmd == "clear") {
    clearTerminal = true;
    return;
  }
  if (cmd == "pwd") {
    output = currentPath + "\n";
    return;
  }

  if (cmd == "ls" || cmd.startsWith("ls ")) {
    bool longFormat = false;
    String pathArg = "";
    if (cmd == "ls -l") {
      longFormat = true;
      pathArg = currentPath;
    } else if (cmd.startsWith("ls -l ")) {
      longFormat = true;
      pathArg = cmd.substring(5);
      pathArg.trim();
    } else if (cmd.startsWith("ls ")) {
      pathArg = cmd.substring(3);
      pathArg.trim();
    }
    if (pathArg.isEmpty()) pathArg = currentPath;
    String targetPath = resolvePath(pathArg);
    File root = LittleFS.open(targetPath, "r");
    if (!root) {
      output = "ls: cannot access '" + pathArg + "': No such file or directory\n";
      return;
    }
    if (!root.isDirectory()) {
      String fileName = targetPath.substring(targetPath.lastIndexOf('/') + 1);
      if (fileName.isEmpty()) fileName = targetPath;
      if (longFormat) output += "- " + String(root.size(), 6) + "B " + fileName + "\n";
      else output += fileName + "\n";
      root.close();
      return;
    }
    File file = root.openNextFile();
    while (file) {
      String fileName = file.name();
      int lastSlash = fileName.lastIndexOf('/');
      if (lastSlash != -1) fileName = fileName.substring(lastSlash + 1);
      if (longFormat) {
        if (file.isDirectory()) output += "d  <DIR> " + fileName + "/\n";
        else output += "- " + String(file.size(), 6) + "B " + fileName + "\n";
      } else {
        output += fileName;
        if (file.isDirectory()) output += "/";
        output += "\n";
      }
      file.close();
      file = root.openNextFile();
      yield();
    }
    root.close();
    if (isProtectedPath(targetPath)) output += "[!] " + targetPath + " is read-only (protected)\n";
    return;
  }

  if (cmd == "cd" || cmd.startsWith("cd ")) {
    String pathArg = (cmd == "cd") ? "" : cmd.substring(3);
    pathArg.trim();
    if (pathArg.isEmpty()) {
      output = "cd: Usage: cd <path>\n";
      return;
    }
    String newPath = resolvePath(pathArg);
    if (LittleFS.exists(newPath)) {
      File f = LittleFS.open(newPath);
      if (f.isDirectory()) {
        currentPath = newPath;
        newPrompt = "root@esp32:" + currentPath + "# ";
      } else output = "cd: " + pathArg + ": Not a directory\n";
      f.close();
    } else output = "cd: " + pathArg + ": No such file or directory\n";
    return;
  }

  if (cmd == "cat" || cmd.startsWith("cat ")) {
    if (cmd == "cat") {
      output = "__CAT_EASTER_EGG__";
      return;
    }
    String pathArg = cmd.substring(4);
    pathArg.trim();
    if (pathArg.isEmpty()) {
      output = "cat: Usage: cat <file>\n";
      return;
    }
    String fullPath = resolvePath(pathArg);
    if (LittleFS.exists(fullPath)) {
      File f = LittleFS.open(fullPath, "r");
      if (f && !f.isDirectory()) {
        while (f.available()) output += (char)f.read();
        output += "\n";
      } else output = "cat: " + pathArg + ": Is a directory\n";
      f.close();
    } else output = "cat: " + pathArg + ": No such file\n";
    return;
  }

  if (cmd == "edit" || cmd.startsWith("edit ")) {
    // 此分支仅用于串口模式，Web端已被拦截
    String pathArg = (cmd == "edit") ? "" : cmd.substring(5);
    pathArg.trim();
    if (pathArg.isEmpty()) {
      output = "edit: Usage: edit <file>\n";
      return;
    }
    if (!canWritePath(resolvePath(pathArg))) {
      output = "edit: Permission denied: '" + pathArg + "' is read-only\n";
      return;
    }
    editingFilePath = resolvePath(pathArg);
    File f = LittleFS.open(editingFilePath, "w");
    if (!f) {
      output = "edit: Cannot create file\n";
      editingFilePath = "";
      return;
    }
    f.close();
    isEditing = true;
    newPrompt = "";
    output = "---------------------------------\nedit: " + editingFilePath + "\nedit: Type 'EOF' to save & exit\n---------------------------------\n";
    return;
  }

  if (cmd == "mkdir" || cmd.startsWith("mkdir ")) {
    String pathArg = (cmd == "mkdir") ? "" : cmd.substring(6);
    pathArg.trim();
    if (pathArg.isEmpty()) {
      output = "mkdir: Usage: mkdir <dir>\n";
      return;
    }
    if (!canWritePath(resolvePath(pathArg))) {
      output = "mkdir: Permission denied: protected directory\n";
      return;
    }
    if (!LittleFS.mkdir(resolvePath(pathArg))) output = "mkdir: cannot create '" + pathArg + "'\n";
    return;
  }

  if (cmd == "touch" || cmd.startsWith("touch ")) {
    String pathArg = (cmd == "touch") ? "" : cmd.substring(6);
    pathArg.trim();
    if (pathArg.isEmpty()) {
      output = "touch: Usage: touch <file>\n";
      return;
    }
    String fullPath = resolvePath(pathArg);
    if (!canWritePath(fullPath)) {
      output = "touch: Permission denied: protected directory\n";
      return;
    }
    if (LittleFS.exists(fullPath)) {
      File f = LittleFS.open(fullPath);
      if (f.isDirectory()) output = "touch: " + pathArg + ": Is a directory\n";
      else output = "touch: " + pathArg + ": File exists\n";
      f.close();
    } else {
      File f = LittleFS.open(fullPath, "w");
      if (f) f.close();
    }
    return;
  }

  if (cmd == "rm" || cmd.startsWith("rm ")) {
    String args = (cmd == "rm") ? "" : cmd.substring(3);
    args.trim();
    if (args.isEmpty()) {
      output = "rm: Usage: rm <path>\n       rm -r <directory>\n       rm [-r] * (remove all in current dir)\n";
      return;
    }
    bool recursive = false;
    String pathArg = args;
    if (args.startsWith("-")) {
      int firstSpace = args.indexOf(' ');
      String flags = (firstSpace == -1) ? args : args.substring(0, firstSpace);
      pathArg = (firstSpace == -1) ? "" : args.substring(firstSpace + 1);
      pathArg.trim();
      if (flags.indexOf('r') != -1) recursive = true;
    }
    if (pathArg == "*" || pathArg == "./*") {
      File dir = LittleFS.open(currentPath, "r");
      if (!dir || !dir.isDirectory()) {
        output = "rm: cannot access '" + currentPath + "'\n";
        if (dir) dir.close();
        g_lastExitCode = 1;
        return;
      }
      File item = dir.openNextFile();
      while (item) {
        String itemName = item.name();
        int lastSlash = itemName.lastIndexOf('/');
        if (lastSlash != -1) itemName = itemName.substring(lastSlash + 1);
        String itemPath = joinPath(currentPath, itemName);
        if (isProtectedPath(itemPath)) {
          item.close();
          item = dir.openNextFile();
          continue;
        }
        bool isDir = item.isDirectory();
        String displayName = itemName + (isDir ? "/" : "");
        item.close();
        if (isDir) {
          if (recursive) {
            if (deleteDirectoryRecursive(itemPath)) output += "rm: removed '" + displayName + "'\n";
            else {
              output += "rm: cannot remove '" + displayName + "': Partial failure\n";
              g_lastExitCode = 1;
            }
          } else {
            output += "rm: " + displayName + "Is a directory (use -r)\n";
            g_lastExitCode = 1;
          }
        } else {
          if (LittleFS.remove(itemPath)) output += "rm: removed '" + itemName + "'\n";
          else {
            output += "rm: cannot remove '" + itemName + "'\n";
            g_lastExitCode = 1;
          }
        }
        item = dir.openNextFile();
        yield();
      }
      dir.close();
      return;
    }
    if (pathArg.isEmpty()) {
      output = "rm: Usage: rm [-r] <path>\n";
      return;
    }
    String fullPath = resolvePath(pathArg);
    if (isProtectedPath(fullPath)) {
      output = "rm: Permission denied: '" + pathArg + "' is protected\n";
      g_lastExitCode = 1;
      return;
    }
    if (!LittleFS.exists(fullPath)) {
      output = "rm: " + pathArg + ": No such file\n";
      g_lastExitCode = 1;
      return;
    }
    File target = LittleFS.open(fullPath, "r");
    if (!target) {
      output = "rm: cannot access '" + pathArg + "'\n";
      g_lastExitCode = 1;
      return;
    }
    bool isDir = target.isDirectory();
    target.close();
    if (isDir) {
      if (!recursive) {
        File testDir = LittleFS.open(fullPath, "r");
        File test = testDir.openNextFile();
        bool isEmpty = (test ? false : true);
        if (test) test.close();
        testDir.close();
        if (!isEmpty) {
          output = "rm: " + pathArg + ": Is a directory (use -r)\n";
          g_lastExitCode = 1;
          return;
        }
        if (LittleFS.rmdir(fullPath)) output = "rm: removed directory '" + pathArg + "'\n";
        else {
          output = "rm: cannot remove '" + pathArg + "'\n";
          g_lastExitCode = 1;
        }
      } else {
        if (deleteDirectoryRecursive(fullPath)) output = "rm: recursively removed '" + pathArg + "'\n";
        else {
          output = "rm: cannot remove '" + pathArg + "': Partial failure\n";
          g_lastExitCode = 1;
        }
      }
    } else {
      if (LittleFS.remove(fullPath)) output = "rm: removed '" + pathArg + "'\n";
      else {
        output = "rm: cannot remove '" + pathArg + "'\n";
        g_lastExitCode = 1;
      }
    }
    return;
  }

  if (cmd == "cp" || cmd.startsWith("cp ")) {
    String args = (cmd == "cp") ? "" : cmd.substring(3);
    args.trim();
    int spacePos = args.indexOf(" ");
    if (spacePos == -1) {
      output = "cp: Usage: cp <src> <dst>\n";
      return;
    }
    String srcPath = args.substring(0, spacePos), dstPath = args.substring(spacePos + 1);
    srcPath.trim();
    dstPath.trim();
    String fullSrc = resolvePath(srcPath), fullDst = resolvePath(dstPath);
    if (isProtectedPath(fullSrc) || isProtectedPath(fullDst)) {
      output = "cp: Permission denied: protected path\n";
      g_lastExitCode = 1;
      return;
    }
    if (!LittleFS.exists(fullSrc)) {
      output = "cp: source not found\n";
      return;
    }
    File srcFile = LittleFS.open(fullSrc, "r");
    if (!srcFile || srcFile.isDirectory()) {
      output = "cp: not a file\n";
      srcFile.close();
      return;
    }
    if (LittleFS.exists(fullDst)) {
      File dstTest = LittleFS.open(fullDst);
      if (dstTest.isDirectory()) { fullDst = joinPath(fullDst, fullSrc.substring(fullSrc.lastIndexOf('/') + 1)); }
      dstTest.close();
    }
    File dstFile = LittleFS.open(fullDst, "w");
    if (!dstFile) {
      output = "cp: create failed\n";
      srcFile.close();
      return;
    }
    while (srcFile.available()) dstFile.write(srcFile.read());
    srcFile.close();
    dstFile.close();
    output = "cp: " + fullSrc + " -> " + fullDst + "\n";
    return;
  }

  if (cmd == "mv" || cmd.startsWith("mv ")) {
    String args = (cmd == "mv") ? "" : cmd.substring(3);
    args.trim();
    int spacePos = args.indexOf(" ");
    if (spacePos == -1) {
      output = "mv: Usage: mv <src> <dst>\n";
      return;
    }
    String srcPath = args.substring(0, spacePos), dstPath = args.substring(spacePos + 1);
    srcPath.trim();
    dstPath.trim();
    String fullSrc = resolvePath(srcPath), fullDst = resolvePath(dstPath);
    if (isProtectedPath(fullSrc) || isProtectedPath(fullDst)) {
      output = "mv: Permission denied: protected path\n";
      g_lastExitCode = 1;
      return;
    }
    if (!LittleFS.exists(fullSrc)) {
      output = "mv: source not found\n";
      return;
    }
    if (LittleFS.exists(fullDst)) {
      File dstTest = LittleFS.open(fullDst);
      if (dstTest.isDirectory()) { fullDst = joinPath(fullDst, fullSrc.substring(fullSrc.lastIndexOf('/') + 1)); }
      dstTest.close();
    }
    if (LittleFS.rename(fullSrc, fullDst)) output = "mv: " + fullSrc + " -> " + fullDst + "\n";
    else {
      output = "mv: failed\n";
      g_lastExitCode = 1;
    }
    return;
  }

