Haico-CC/ESP32-Qinux/ESP32-Qinux.ino
  if (cmd == "echo" || cmd.startsWith("echo ")) {
    if (cmd == "echo") {
      output = "echo: Usage: echo <text> [> file] [>> file]\n";
      return;
    }
    String rest = cmd.substring(5);
    rest.trim();
    int gtPos = -1, gtgtPos = -1;
    bool inQuote = false;
    char quoteChar = 0;
    for (int i = 0; i < rest.length(); i++) {
      char c = rest[i];
      if ((c == '"' || c == '\'') && (i == 0 || rest[i - 1] != '\\')) {
        if (!inQuote) {
          inQuote = true;
          quoteChar = c;
        } else if (c == quoteChar) inQuote = false;
      } else if (!inQuote) {
        if (c == '>' && i + 1 < rest.length() && rest[i + 1] == '>') {
          gtgtPos = i;
          break;
        } else if (c == '>' && gtPos == -1) gtPos = i;
      }
    }
    String text = "", filePath = "";
    bool append = false;
    if (gtgtPos != -1) {
      text = rest.substring(0, gtgtPos);
      filePath = rest.substring(gtgtPos + 2);
      append = true;
    } else if (gtPos != -1) {
      text = rest.substring(0, gtPos);
      filePath = rest.substring(gtPos + 1);
      append = false;
    } else text = rest;
    text.trim();
    filePath.trim();
    if (text.length() >= 2 && ((text.startsWith("\"") && text.endsWith("\"")) || (text.startsWith("'") && text.endsWith("'")))) text = text.substring(1, text.length() - 1);
    if (!filePath.isEmpty()) {
      if (!canWritePath(resolvePath(filePath))) {
        output = "echo: Permission denied: '" + filePath + "' is read-only\n";
        g_lastExitCode = 1;
        return;
      }
      File f = LittleFS.open(resolvePath(filePath), append ? "a" : "w");
      if (f) {
        f.print(text);
        f.close();
      } else {
        output = "echo: write error\n";
        g_lastExitCode = 1;
      }
    } else output = text + "\n";
    return;
  }

  if (cmd == "grep" || cmd.startsWith("grep ")) {
    String rest = (cmd == "grep") ? "" : cmd.substring(5);
    rest.trim();
    int spaceIdx = rest.indexOf(" ");
    if (spaceIdx == -1) {
      output = "grep: Usage: grep <pattern> <file>\n";
      return;
    }
    String pattern = rest.substring(0, spaceIdx), fileArg = rest.substring(spaceIdx + 1);
    fileArg.trim();
    String fullPath = resolvePath(fileArg);
    if (LittleFS.exists(fullPath)) {
      File f = LittleFS.open(fullPath, "r");
      if (f && !f.isDirectory()) {
        int lineNum = 0;
        String line;
        while (f.available()) {
          char c = f.read();
          if (c == '\n') {
            if (line.indexOf(pattern) != -1) output += String(lineNum) + ":" + line + "\n";
            line = "";
            lineNum++;
          } else line += c;
        }
        if (!line.isEmpty() && line.indexOf(pattern) != -1) output += String(lineNum + 1) + ":" + line + "\n";
        f.close();
      }
    } else {
      output = "grep: " + fileArg + ": No such file\n";
      g_lastExitCode = 1;
    }
    return;
  }

  if (cmd == "cpuinfo") {
    output += "cpuinfo: Chip Model:    " + String(ESP.getChipModel()) + "\n";
    output += "cpuinfo: Chip Revision: " + String(ESP.getChipRevision()) + "\n";
    output += "cpuinfo: Cores:         " + String(ESP.getChipCores()) + "\n";
    output += "cpuinfo: CPU Freq:      " + String(ESP.getCpuFreqMHz()) + " MHz\n";
    output += "cpuinfo: SDK Version:   " + String(ESP.getSdkVersion()) + "\n";
    output += "cpuinfo: Chip ID:       " + String((uint32_t)ESP.getEfuseMac(), HEX) + "\n";
    return;
  }

  if (cmd == "free") {
    uint32_t heapTotal = ESP.getHeapSize(), heapFree = ESP.getFreeHeap(), heapUsed = heapTotal - heapFree;
    output += "free: [Heap Memory]\n";
    output += "free: Total:     " + String(heapTotal / 1024) + " KB\n";
    output += "free: Used:      " + String(heapUsed / 1024) + " KB\n";
    output += "free: Free:      " + String(heapFree / 1024) + " KB\n";
    if (ESP.getPsramSize() > 0) {
      uint32_t psramTotal = ESP.getPsramSize(), psramFree = ESP.getFreePsram();
      output += "free: [PSRAM]\n";
      output += "free: Total:     " + String(psramTotal / 1024) + " KB\n";
      output += "free: Free:      " + String(psramFree / 1024) + " KB\n";
    }
    return;
  }

  if (cmd == "df") {
    uint64_t total = LittleFS.totalBytes(), used = LittleFS.usedBytes();
    output += "df: File System: LittleFS\n";
    output += "df: Total Size:  " + String(total / 1024) + " KB\n";
    output += "df: Used:        " + String(used / 1024) + " KB\n";
    output += "df: Free:        " + String((total - used) / 1024) + " KB\n";
    return;
  }

  if (cmd == "sysinfo") {
    unsigned long uptimeSec = millis() / 1000;
    output += "sysinfo: Uptime:      " + String(uptimeSec / 86400) + "d " + String((uptimeSec % 86400) / 3600) + "h\n";
    output += "sysinfo: Chip:        " + String(ESP.getChipModel()) + "\n";
    output += "sysinfo: Heap Free:   " + String(ESP.getFreeHeap() / 1024) + " KB\n";
    output += "sysinfo: WiFi IP:     " + WiFi.softAPIP().toString() + "\n";
    return;
  }

  if (cmd == "date" || cmd.startsWith("date -s")) {
    if (cmd == "date") {
      time_t now;
      time(&now);
      struct tm timeinfo;
      localtime_r(&now, &timeinfo);
      char timeStr[64];
      strftime(timeStr, sizeof(timeStr), "%c", &timeinfo);
      output += "date: " + String(timeStr) + "\n";
    } else {
      String args = cmd.substring(7);
      args.trim();
      if (args.isEmpty()) {
        output = "date: Usage: date -s \"YYYY-MM-DD HH:MM:SS\"\n";
      } else {
        String dateStr = args;
        if ((dateStr.startsWith("\"") && dateStr.endsWith("\"")) || (dateStr.startsWith("'") && dateStr.endsWith("'"))) dateStr = dateStr.substring(1, dateStr.length() - 1);
        time_t newTime;
        if (parseDateTimeString(dateStr, newTime)) {
          setSystemTime(newTime);
          output = "date: Date/Time set to: " + dateStr + "\n";
        } else output = "date: Usage: date -s \"YYYY-MM-DD HH:MM:SS\"\n";
      }
    }
    return;
  }

  if (cmd == "reset") {
    output += "reset: Last Reset: " + getResetReason() + "\n";
    return;
  }

  if (cmd == "gpio") {
    output += "gpio: Pin | Level\ngpio: ----+------\n";
    for (int pin = 0; pin <= 48; pin++) {
      if (isSafeGpio(pin)) { output += "gpio: " + String(pin < 10 ? "  " : " ") + String(pin) + " | " + String(digitalRead(pin)) + "\n"; }
    }
    return;
  }

