Haico-CC/ESP32-Qinux/ESP32-Qinux.ino
  if (cmd == "gpio -s" || cmd.startsWith("gpio -s ")) {
    String args = (cmd == "gpio -s") ? "" : cmd.substring(7);
    args.trim();
    int space = args.indexOf(' ');
    if (space == -1) {
      output = "gpio: Usage: gpio -s <pin> <level>\n";
      return;
    }
    int pin = args.substring(0, space).toInt(), level = args.substring(space + 1).toInt();
    if (!isSafeGpio(pin)) {
      output = "gpio: Error: GPIO not safe!\n";
      return;
    }
    if (level != 0 && level != 1) {
      output = "gpio: Error: Level must be 0 or 1!\n";
      return;
    }
    pinMode(pin, OUTPUT);
    digitalWrite(pin, level);
    output = "gpio: GPIO" + String(pin) + " set to " + String(level) + "\n";
    return;
  }

  if (cmd == "adc" || cmd.startsWith("adc ")) {
    int adcPin = 4;
    if (cmd.startsWith("adc ")) {
      String arg = cmd.substring(4);
      arg.trim();
      if (!arg.isEmpty()) adcPin = arg.toInt();
    }
    if (!isAdc1Pin(adcPin)) {
      output += "adc: GPIO" + String(adcPin) + " is not a valid ADC1 pin\n";
      output += "adc: Valid ADC1 pins for this chip: " + getAdc1ValidPins() + "\n";
      output += "adc: Note: ADC2 pins not supported (WiFi conflict)\n";
      g_lastExitCode = 1;
    } else {
      analogReadResolution(12);
#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32S3)
      analogSetAttenuation(ADC_11db);
#endif
      int raw = analogRead(adcPin);
      output += "adc: GPIO" + String(adcPin) + ": " + String(raw) + " / " + String((raw / 4095.0) * 3.3, 2) + "V\n";
    }
    return;
  }

  if (cmd == "wifi" || cmd.startsWith("wifi ")) {
    String args = (cmd == "wifi") ? "" : cmd.substring(5);
    args.trim();
    handleWifiCommand(args, output);
    return;
  }

  if (cmd == "fortune") {
    randomSeed(ESP.getEfuseMac() ^ millis());
    output = FORTUNES[random(FORTUNE_COUNT)] + String("\n");
    return;
  }
  if (cmd == "matrix") {
    output = "__MATRIX_MODE__";
    return;
  }

  if (!cmd.isEmpty()) {
    output = "Command not found: " + cmd + "\nType 'help' for available commands.\n";
    g_lastExitCode = 1;
  }
}

// ========== WebSocket事件处理 ==========
void onWebSocketEvent(uint8_t num, WStype_t type, uint8_t* payload, size_t length) {
  if (type != WStype_TEXT) return;
  llmActiveClient = num;
  String msg = (char*)payload;

  if (msg.startsWith("__DL_ACK__:")) {
    if (chunkState.active && !chunkState.isUpload && !chunkState.sending) { sendNextChunk(); }
    return;
  }

  if (msg.startsWith("__UPLOAD_START__:")) {
    String args = msg.substring(17);
    String fname = "";
    size_t fsize = 0;
    size_t cChunkSize = CHUNK_SIZE;
    int p1 = args.indexOf("filename:");
    int p2 = args.indexOf(",size:");
    int p3 = args.indexOf(",chunk_size:");
    if (p1 != -1 && p2 != -1) {
      fname = args.substring(p1 + 9, p2);
      fsize = args.substring(p2 + 6, (p3 != -1) ? p3 : args.length()).toInt();
      if (p3 != -1) cChunkSize = args.substring(p3 + 12).toInt();
    }
    if (cChunkSize == 0) cChunkSize = CHUNK_SIZE;
    handleUploadStart(fname, fsize, cChunkSize, num);
    return;
  }

  if (msg.startsWith("__UPLOAD_CHUNK__:")) {
    String args = msg.substring(17);
    int idxPos = args.indexOf("index:");
    int dataPos = args.indexOf(",");
    if (idxPos != -1 && dataPos != -1) {
      size_t idx = args.substring(idxPos + 6, dataPos).toInt();
      String b64 = args.substring(dataPos + 1);
      handleUploadChunk(idx, b64, num);
    }
    return;
  }

  if (msg == "__UPLOAD_END__") {
    if (chunkState.active && chunkState.isUpload) {
      chunkState.file.flush();
      chunkState.file.close();
      chunkState.active = false;
    }
    return;
  }

  // ===== Web 编辑器保存 =====
  if (msg.startsWith("__EDIT_SAVE__:")) {
    String payload = msg.substring(14);
    int sep = payload.indexOf(':');
    String filename;
    String b64Content;
    if (sep != -1) {
      filename = payload.substring(0, sep);
      b64Content = payload.substring(sep + 1);
    } else {
      if (clientEditFiles.count(num)) {
        filename = clientEditFiles[num];
        b64Content = payload;
      } else {
        webSocket.sendTXT(num, "{\"output\":\"edit: Save failed: no active file\\n\"}");
        return;
      }
    }

    String fullPath = resolvePath(filename);
    if (!canWritePath(fullPath)) {
      webSocket.sendTXT(num, "{\"output\":\"edit: Permission denied\\n\"}");
      return;
    }

    std::vector<uint8_t> data = base64Decode(b64Content);
    File f = LittleFS.open(fullPath, "w");
    if (!f || f.isDirectory()) {
      if (f) f.close();
      webSocket.sendTXT(num, "{\"output\":\"edit: Cannot write file\\n\"}");
      return;
    }
    size_t written = f.write(data.data(), data.size());
    f.close();

    clientEditFiles.erase(num);

    String resp = "{\"output\":\"edit: File saved: " + escapeJson(filename) +
                  " (" + String(written) + " bytes)\\n\"}";
    webSocket.sendTXT(num, resp);
    return;
  }

  // ===== Web 编辑器启动 =====
  if (msg == "edit" || msg.startsWith("edit ")) {
    String pathArg = (msg == "edit") ? "" : msg.substring(5);
    pathArg.trim();
    if (pathArg.isEmpty()) {
      String resp = "{\"output\":\"edit: Usage: edit <file>\\n\"}";
      webSocket.sendTXT(num, resp);
      return;
    }

    String fullPath = resolvePath(pathArg);
    if (isProtectedPath(fullPath)) {
      String resp = "{\"output\":\"edit: Permission denied: protected file\\n\"}";
      webSocket.sendTXT(num, resp);
      return;
    }

    String fileContent = "";
    if (LittleFS.exists(fullPath)) {
      File f = LittleFS.open(fullPath, "r");
      if (f && !f.isDirectory()) {
        size_t fSize = f.size();
        // 限制编辑器最大打开文件大小为 128KB，防止 readString() OOM 崩溃
        if (fSize > 128 * 1024) {
          f.close();
          String resp = "{\"output\":\"edit: File too large for editor (max 128KB, use dl to download)\\n\"}";
          webSocket.sendTXT(num, resp);
          return;
        }
        fileContent = f.readString();
        f.close();
      } else if (f) f.close();
    }

