Haico-CC/ESP32-Qinux/ESP32-Qinux.ino
    clientEditFiles[num] = fullPath;

    String json = "{\"edit_start\":{";
    json += "\"filename\":\"" + escapeJson(pathArg) + "\",";
    json += "\"content\":\"" + escapeJson(fileContent) + "\"";
    json += "}}";
    webSocket.sendTXT(num, json);
    return;
  }

  if (llmGenerationActive && !msg.startsWith("llama status")) {
    String resp = "{\"output\":\"llama: Busy generating.\\n\",";
    resp += "\"prompt\":\"root@esp32:" + currentPath + "# \"}";
    webSocket.sendTXT(num, resp);
    return;
  }

  llmActiveClient = num;
  String output, newPrompt, dlFileName, dlContent;
  bool clearTerminal, triggerUpload;

  if (msg.startsWith("__UPLOAD__:")) {
    const int PREFIX_LEN = 11;
    int firstSep = msg.indexOf(':', PREFIX_LEN);
    if (firstSep != -1) {
      String filename = msg.substring(PREFIX_LEN, firstSep);
      int lastSlash = filename.lastIndexOf('/'), lastBackslash = filename.lastIndexOf('\\');
      int lastPos = max(lastSlash, lastBackslash);
      if (lastPos != -1) filename = filename.substring(lastPos + 1);
      filename.replace("/", "");
      filename.replace("\\", "");
      filename.replace("..", "");
      if (filename.isEmpty()) filename = "upload_" + String(millis()) + ".bin";
      String fullPath = resolvePath(filename);
      if (!canWritePath(fullPath)) {
        String resp = "{\"prompt\":\"root@esp32:" + currentPath + "# \",\"output\":\"ul: Permission denied: protected directory\\n\"}";
        webSocket.sendTXT(num, resp);
        return;
      }
      String b64data = msg.substring(firstSep + 1);
      std::vector<uint8_t> binData = base64Decode(b64data);
      int lastSlashPos = fullPath.lastIndexOf('/');
      if (lastSlashPos > 0 && !LittleFS.exists(fullPath.substring(0, lastSlashPos))) LittleFS.mkdir(fullPath.substring(0, lastSlashPos));
      File f = LittleFS.open(fullPath, "w");
      if (f && !f.isDirectory()) {
        size_t written = f.write(binData.data(), binData.size());
        f.close();
        output = (written == binData.size()) ? "ul: Saved '" + filename + "' (" + String(written) + " bytes)\n" : "ul: Write incomplete: " + String(written) + "/" + String(binData.size()) + "\n";
      } else {
        if (f) f.close();
        output = "ul: Failed to open: " + fullPath + "\n";
      }
      String resp = "{\"prompt\":\"root@esp32:" + currentPath + "# \",\"output\":\"" + escapeJson(output) + "\"}";
      webSocket.sendTXT(num, resp);
      return;
    }
    webSocket.sendTXT(num, "{\"prompt\":\"root@esp32:" + currentPath + "# \",\"output\":\"ul: Protocol error\\n\"}");
    return;
  }

  executeCommand(msg, output, newPrompt, clearTerminal, dlFileName, dlContent, triggerUpload);
  String resp = "{\"prompt\":\"" + escapeJson(newPrompt) + "\",";
  if (!output.isEmpty()) resp += "\"output\":\"" + escapeJson(output) + "\",";
  resp += "\"clear\":" + String(clearTerminal ? "true" : "false");
  if (!dlFileName.isEmpty()) resp += ",\"download\":{\"filename\":\"" + escapeJson(dlFileName) + "\",\"content\":\"" + escapeJson(dlContent) + "\"}";
  if (triggerUpload) resp += ",\"upload\":true";
  resp += "}";
  webSocket.sendTXT(num, resp);
}

// ========== 串口输入处理 ==========
void processSerialInput() {
  while (Serial.available() > 0) {
    char c = Serial.read();
    if (c == '\n' || c == '\r') {
      if (c == '\r' && Serial.peek() == '\n') Serial.read();
      if (!serialInputBuffer.isEmpty()) {
        String cmd = serialInputBuffer;
        String output, newPrompt, dummyDlF, dummyDlC;
        bool clearTerminal, dummyUl;
        Serial.println();
        executeCommand(cmd, output, newPrompt, clearTerminal, dummyDlF, dummyDlC, dummyUl);
        if (clearTerminal)
          for (int i = 0; i < 20; i++) Serial.println();
        Serial.print(output);
        if (!isEditing) Serial.print(newPrompt);
        serialInputBuffer = "";
      } else {
        Serial.println();
        if (!isEditing) Serial.print("root@esp32:/# ");
      }
    } else if (c == 8) {
      if (!serialInputBuffer.isEmpty()) {
        serialInputBuffer.remove(serialInputBuffer.length() - 1);
        Serial.write(8);
        Serial.write(' ');
        Serial.write(8);
      }
    } else {
      Serial.write(c);
      serialInputBuffer += c;
    }
  }
}

// ========== Web服务器处理 ==========
void handleRoot() {
  webServer.send_P(200, "text/html", HTML_CONTENT);
}
void handleNotFound() {
  webServer.sendHeader("Location", "http://" + AP_IP.toString() + "/");
  webServer.send(302, "text/plain", "Redirecting...");
}

// ========== 初始化与主循环 ==========
void setup() {
  Serial.begin(SERIAL_BAUD);
  delay(1000);
  Serial.println("\n\n-------------------------------");
  Serial.println("   ESP32-QINUX SYSTEM BOOT    ");
  Serial.println("-------------------------------");
  initAllGpioLow();
  if (!LittleFS.begin(true, "/littlefs", 5, "storage")) {
    Serial.println("LittleFS Failed!");
    return;
  }
  Serial.println("LittleFS OK.");
  WiFi.mode(WIFI_AP);
  WiFi.softAPConfig(AP_IP, AP_IP, IPAddress(255, 255, 255, 0));
  WiFi.softAP(AP_SSID, AP_PASS);
  Serial.print("AP: ");
  Serial.println(AP_SSID);
  dnsServer.start(DNS_PORT, "*", AP_IP);
  webServer.on("/", handleRoot);
  webServer.onNotFound(handleNotFound);
  webServer.begin();
  webSocket.begin();
  webSocket.onEvent(onWebSocketEvent);
  if (!LittleFS.exists("/etc")) LittleFS.mkdir("/etc");
  if (!LittleFS.exists("/home")) LittleFS.mkdir("/home");
  if (!LittleFS.exists("/sys")) LittleFS.mkdir("/sys");
  if (!LittleFS.exists("/bin")) LittleFS.mkdir("/bin");
  Serial.println("Qinux System Ready.");
  Serial.print("root@esp32:/# ");
  setWiFiTxPower(2);
}

void loop() {
  dnsServer.processNextRequest();
  webServer.handleClient();
  webSocket.loop();
  processSerialInput();
  checkChunkTimeout(); 

  if (chunkState.active && !chunkState.isUpload && !chunkState.sending) {
    sendNextChunk();
  }
}